[
{"asin": "B09RD7XM9X", "text": "There was absolutely nothing wrong with my old Kindle paper white.  It worked fine - until my dog chewed it up and shattered the glass. I’m lucky she didn’t break off and swallow any pieces.Knowing Prime Day in July was approaching, I impatiently waited thinking I could get a new kindle for a better price than was listed.I wasn’t disappointed. I bought it with ads and 3 months of Kindle Unlimited for $50 off the regular price.  Readers who are afraid of a Kindle with ads don’t need to be.  The ads appear when you open the Kindle and appear on the bottom of the page. Once you open a book, all ads disappear and DO NOT INTERFERE WITH YOUR READING.  I stress this because it seems people unnecessarily pay more for a kindle without ads when they don’t need to.I’m not sure if it’s because I have a different internet provider or if it’s the new paper white, but books download in less than 5 seconds, which is great because I have hundred of books on it.One thing about the old paper white I didn’t like was that if you made a collection, the books still remained on the list in the main library, so they’re on the kindle twice taking up unnecessary storage space. I haven’t made any collections yet as I’m still downloading the hundreds of books from my Amazon account that I’ve collected since my first kindle many many years ago.While I’m a lover of real books, I had to stopbuying them because I have no more room. I have one bookcase with a complete set of Stephen King books in hardcover, and another bookcase with various books I’ve kept - science, bios, history - but everything now is on my Kindle.  I love it because I can stick it my purse and it doesn’t really add any extra weight.  This is important because I’ve had 2 surgeries on each arm following a car accident, so my arms are not as strong as they used to be.I also use my kindle to borrow library books. What’s great about it is you don’t have to run to the library in the middle of a snow storm to return a book that’s due. If you don’t return the book yourself, kindle returns it and it disappears from your kindle.And then there’re the free books offered by Amazon. I downloaded the complete set of Dickens’ works - for free.  I can’t even begin to tell you the number of classics I’ve downloaded for free as well. I’ll probably die before I read everything on my Kindle!One thing I would never do is leave my kindle unprotected without using a cover.  I have no intention of using my new kindle until the cover comes tomorrow.  I’m notorious for carelessness  - my second iPad was only 18 months old when “somehow” the screen cracked - and it had a protective case. It’s my second iPad because I accidentally stepped on the first one and shattered the screen. That one was in a case too.  My iPhone has deep scratches as well even though it is in a case 🤷🏻‍♀️ I’m looking forward to this new case because it has a strap I can slip my hand through making it easy to read with one hand without worrying about accidentally dropping it.It was well worth waiting for Prime Day.", "title": "Lighter than ever", "location_and_date": "Reviewed in the United States 🇺🇸 on July 14, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "The Kindle Paperwhite (8 GB) is the ultimate reading companion, offering an unparalleled reading experience that combines convenience, comfort, and an extensive library of books. With its high-resolution display, waterproof design, and long battery life, this e-reader is a book lover's dream come true.The standout feature of the Kindle Paperwhite is its high-resolution display. The 6-inch, 300ppi E Ink Carta touchscreen provides sharp and crisp text that closely resembles ink on paper. The adjustable built-in light allows for comfortable reading in any lighting conditions, whether it's bright sunlight or a dimly lit room. The anti-glare screen ensures minimal eyestrain, making it a pleasure to read for extended periods.The Kindle Paperwhite (8 GB) offers ample storage for thousands of books, allowing you to carry your entire library wherever you go. With its 8 GB of storage capacity, you can download and store a vast collection of e-books, magazines, and audiobooks. The device seamlessly syncs your reading progress across devices, so you can effortlessly switch between your Kindle and the Kindle app on your smartphone or tablet without losing your place.One of the key advantages of the Kindle Paperwhite is its waterproof design. With an IPX8 rating, it is capable of withstanding immersion in up to 2 meters of fresh water for up to 60 minutes. This feature makes it perfect for reading at the beach, by the pool, or even in the bathtub, without worrying about accidental water damage. It offers peace of mind and allows you to fully enjoy your reading time in various environments.The Kindle Paperwhite is designed with comfort in mind. The lightweight and ergonomic design make it easy to hold for hours without straining your hand. The flush front display and smooth, edge-to-edge glass provide a seamless reading experience, allowing you to focus solely on the content. The device's physical page-turn buttons offer a tactile feel that mimics the sensation of flipping through pages, enhancing the overall reading experience.The Kindle Paperwhite also provides a range of customization options. You can adjust the font size, font type, and line spacing to suit your personal reading preferences. The built-in dictionary and vocabulary builder feature allow for instant word lookup and the ability to create personalized word lists for later review. Additionally, the Kindle Paperwhite supports Whispersync, enabling you to switch seamlessly between reading and listening to audiobooks.Battery life is exceptional, lasting for weeks on a single charge, depending on usage. The efficient E Ink display technology consumes minimal power, allowing you to enjoy uninterrupted reading without frequent charging interruptions. This extended battery life is particularly useful for travelers or those who prefer extended reading sessions.In conclusion, the Kindle Paperwhite (8 GB) is the ultimate e-reader for book enthusiasts. With its high-resolution display, waterproof design, extensive storage capacity, and long battery life, it offers an unmatched reading experience. Whether you're reading by the pool, in bed, or during your daily commute, the Kindle Paperwhite delivers crisp text, customizable settings, and a vast library at your fingertips. If you're passionate about reading and desire a device that provides comfort, convenience, and access to a world of literature, the Kindle Paperwhite is an investment that will elevate your reading pleasure to new heights.", "title": "The Ultimate Reading Companion - Paperwhite Delivers an Unmatched Reading Experience", "location_and_date": "Reviewed in the United States 🇺🇸 on July 9, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "OK, I fouled up with my Kindle Paperwhite 11th edition purchase. It was Prime Day and the Kindle was marked WAY DOWN, and I opted for the bundle: Kindle + Charger + fabric cover. Now don't get me wrong, the Charger is nice and the fabric cover is very nice, but for a device Amazon says you only need to charge 5 times a year, getting a premium charger doesn't really make much sense. I already have plenty of chargers, and the Kindle will charge overnight whether I use their super-fast premium charger or something else. And while the case is undeniably nice, you can get one for less than half the money from other sellers on Amazon.I did not make the mistake of getting the ad-free version. The ad appears on the lock screen and as soon as you swipe the screen, it goes away and stays away for your entire reading session. It's 100% unobtrusive. Other people have given the Kindle one star because they bought the ad-free version, and were angry there are still \"suggestions\" on the Home screen that they  consider ads. All I can say is that you get that no matter what, and the solution is to switch to the Library screen rather than the Home screen; that's very easy on the latest software version.The other huge mistake I made over 4 years ago was subscribing to Kindle Unlimited and somehow not knowing that it was automatically renewing silently every month (for $9.99). I paid enough to buy several Kindles. I guess I thought it was part of Amazon Prime or just something that comes with a Kindle. You can bundle Kindle Unlimited \"Free\" for 3 months with your Kindle purchase, but just watch out when that 3 months are over. I have generally found Kindle Unlimited books second rate (with a few exceptions).I bought one of the original Kindle Fire versions and the first Kindle Fire HD. They were cool, but I didn't end up using them much. They didn't have good battery life, they were hard to read outdoors, and Kindle software on other portable devices was fine. I think the first one eventually failed, and I gave the HD away to someone who needed to do something that required a Kindle. I have a nice Windows tablet.But I have always wanted a Paperwhite because of its long battery life and superb readability outdoors. Plus it was heavily discounted on Prime Day and I bought one.So how did it live up to expectations? Pretty well. The \"10 weeks\" battery life claim seems exaggerated, but still if you pick it up to go somewhere, it will probably be charged and last another day. Outdoor readability is simply amazing.After receiving the device, the software updated. I think it updated twice. My \"Experimental Web Browser\" turned into the \"Web Browser\" and the navigation improved markedly (addressing issues I read in other 1-star reviews). The web browser is still very limited and doesn't display some web pages correctly (like the Internet  Archive), and error messages still mention the \"Experimental\" browser. You can't access YouTube, for example, Twitter doesn't seem to work at all, and the New York Times is not readable.On books, three-level table of contents don't work on the Kindle, although they work on Kindle for PC.I had a very good experience emailing a PDF document downloaded from our local Planning Commission to the Kindle. Things you send to the Kindle arrive very fast. Amazon did, however, require me to verify myself as a sender before it would deliver email attachments to the Kindle, even though my email address is on the approved senders list at Amazon. Also plugging the Kindle to a PC lets you drag and drop supported document types (notably MOBI and PDF) to the Kindle where the immediately appear in your Library. The Send to Kindle for PC app is currently broken as reported by me and others on Amazon forums.The device is somewhat sluggish in general with a 1-second delay for most things: swipes, scrolls and navigation. That's certainly not something that would interfere with reading a book. There are so many different ways to navigate, that it can appear jumbled and confusing, plus the software updates I got changed everything, making me re-learn the UI. I think in the end that I will be accustomed to it and it will appear more natural.One severe limitation is that you cannot play audio files in general. While it supports Bluetooth headphones for books from Audible, it cannot play music or audio books in general. (I hope this is enhanced in a future software update.)So should you buy one of these? If you want to sit outdoors under a tree or at the beach for hours on end reading a book, a Kindle Paperwhite makes a lot of sense. The reading experience is good, it's visually sharp and the charge lasts a long time. If you want to listen to music, or do much of anything else you can do on a phone or a tablet computer, you're out of luck.", "title": "First impressions, should you buy one, and how to save money", "location_and_date": "Reviewed in the United States 🇺🇸 on July 23, 2022", "verified": true, "rating": "4.0"},
{"asin": "B09RD7XM9X", "text": "This Kindle was purchased to replace a still-in-service original Paperwhite bought in Oct 2012.  Its battery was starting to hold it's charge for shorter and shorter times.Functionally, it still works fine, if I disregard the now-degraded battery life.  I use it daily, averaging over an hour of use.This new Kindle is a bit of a mixed-bag.The return window on it has just closed, so my dithering on whether or not to return it is now moot.I read some feedback suggesting that the display, while higher-dot-pitch, was a bit fuzzy (due to the flush touch-screen) and seemed to be something of a fingerprint magnet.  I discounted those comments before purchasing.I was surprised to discover that the fingerprint issue *is* a real thing and can, at times, be distracting.  The slight degradation in clarity seems to be balanced off against the higher dot-pitch.  This goes hand-in-hand with the flush-front design.  I'd like it more without the fingerprints being so much more noticeable.After a month, the charge on the new unit dropped low enough for me to plug it in for a full charge.  Their published battery-life estimates have always been based on what I consider very light usage levels.  But certainly reasonable and easy to extrapolate battery lifetime with heavier usage.One of the worst parts of the Kindle experience from the beginning is the totally tone-deaf view of the readers by the software development team (or, more accurately, their management).  They actively go out of their way to deny the end user the ability to customize their Kindles.  Locking down the system to prevent any third-party software access.  (\"have [it] painted any color he wants as long as it's black\")I was greatly saddened when I discovered that the current generation of the reader OS has been hardened enough to so-far stymied the developer community.I look forward to the day they break it.  And break it hard.My original Paperwhite has been jailbroken/hacked/rooted/customized so I could tweak its settings.  And it's been in airplane mode for a decade.  I side-load everything I read.  *Nothing* goes over the air.I like reading with *very* little margin on the page.  I already have a quarter-inch bezel on the device, I want to put more words on the page, narrowing the side margins even more than the narrowest option currently available to the native operating system.  My old PW is set that way.I like having custom lock-screen images on my unit.  I have a directory full of images in the original that get randomly shuffled and picked each time the lock screen comes up.  The new unit has the original tiny collection provided by the OS that feels old after a month with no access to the storage directory.How difficult would it be to give access to an image directory for the end user with the desire to do so?  *That* should be easy to implement.  It's not like that would be a directory full of executables.If someone can tickle the unit into *executing code through an image file*, then your team might want to reconsider being in the OS business.It also seems like the price differential between the 8GB and 16GB models has dropped since I purchased my unit only five weeks ago.I would probably have sprung for the extra RAM, even though I doubt it would be useful in my case unless I got into audiobooks in a big way.I've been using the blue-white light on the original reader for so long that I haven't felt the need to go out of my way to use the 'warm-light' feature on the new one.  I *have* set the automatic time-based adjustment feature and it is in use during nighttime reads, but it hasn't had a noticeable impact (positive or negative) on my habitual reading.  It probably does improve reading for many people, though.", "title": "Does everything as advertised, but would be better with more customization ability", "location_and_date": "Reviewed in the United States 🇺🇸 on May 13, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09RD7XM9X", "text": "Reading ExperienceI recently purchased the Kindle Paperwhite (8 GB) from Amazon, and I must say it has completely transformed my reading experience. As an avid book lover, I've always cherished the feel of physical books, but the Paperwhite has won me over with its incredible features and convenience.First and foremost, the display is nothing short of impressive. The high-resolution screen provides crystal-clear text that rivals the printed page. Whether I'm reading in broad daylight or in a dimly lit room, the built-in front light ensures a glare-free and comfortable reading experience. The adjustable font sizes are a boon for readers with varying visual preferences, allowing me to customize the text to my liking.The lightweight and compact design of the Kindle Paperwhite make it incredibly portable. I can easily slip it into my bag and take it with me wherever I go. Gone are the days of lugging around heavy books during travels or commutes. With my entire library at my fingertips, I now have access to a vast collection of e-books on a single device. The 8 GB storage capacity provides ample space for all my favorite reads, and I can even choose to expand it further if needed.One feature that sets the Paperwhite apart is its remarkable battery life. It lasts for weeks on a single charge, allowing me to indulge in hours of uninterrupted reading without worrying about running out of power. This is particularly handy during long trips or when I'm engrossed in a gripping story and can't put it down.Navigating through the Kindle interface is intuitive and user-friendly. I love how easy it is to purchase and download e-books directly from the Kindle Store. The syncing feature ensures that my progress is seamlessly updated across all my devices, be it my Kindle, smartphone, or tablet. This means I can pick up right where I left off, regardless of which device I'm using.Lastly, I must mention the added benefits of Kindle Unlimited and Prime Reading. With Kindle Unlimited, I have access to an extensive library of e-books and audiobooks, allowing me to explore new authors and genres. Prime Reading offers a rotating selection of popular titles at no additional cost, further enhancing my reading options.In conclusion, the Kindle Paperwhite has revolutionized the way I read. Its exceptional display, portability, long battery life, and seamless integration with the Kindle ecosystem have made it an indispensable companion for any book enthusiast. Whether you're an avid reader or someone looking to dive into the world of e-books, the Kindle Paperwhite is a game-changer that delivers a superior reading experience. I wholeheartedly recommend it to anyone seeking the perfect balance between technology and the joy of reading.", "title": "A Game-Changer for Book Lovers: Kindle Paperwhite Delivers an Exceptional", "location_and_date": "Reviewed in the United States 🇺🇸 on July 5, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "So happy I bit the bullet and bought this. I love to read and now I do it so much more. It’s easy to take around with me wherever I go. People complain about a lag when using it, I have not noticed it. It’s a little heavy but it’s manageable. The lighting options are amazing, so many options so I can always have it just how I want it. I got it with ads and I don’t mind it, I get the occasional book rec that looks interesting I thought it would be annoying but it’s not. Books sync from my phone to my kindle so fast it blows my mind. It’s so convenient. The battery life is insane! I read for about 2 hours a day on it and I still go multiple weeks before I have to charge it. I’ve had it for a couple months now and I’ve had no issues with it at all. I got mine when it went on sale a little, I was between the paperwhite and the regular kindle, I’m happy I went with this one, but if you are worried about the larger size though it might not be for you. If you are on the fence go for it, I wish I would have bought it sooner.", "title": "Best purchase I ever made", "location_and_date": "Reviewed in the United States 🇺🇸 on July 15, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "PROS: Well, I REALLY like the 11th Gen over my 7th Gen.  I'll do it in 4 points:1-Larger Screen.. Nice2-Color Temp adjustment for the screen.  My background is photography so to me the new screen goes from say 8000 degrees Kelvin to about 2500 degrees Kelvin.  I'm happy around 4700-50003-LONGER battery life.. like 2 months vs 3 weeks4- USB-C!! YES! (my old microUSB was always getting wobbly.I did not mention the increase from \"4\"GB to \"8\"GB..because ..well. in the 7th Gen  the 4GB  is actually 3.1GB  with the rest taken up by the OS  on the new one.. it's actually...wait for it.. 6.25GB! Yep  the OS went from .9GB to 1.75GB!  A bit piggy for me.  I made a joke with a few of the Kindle Tech people that they got ideas from Windows Vista!.  Most got the joke.CONS: Now  onto issues..several which are really for how I use my Kindle:1- ok  the not quite 8GB issue.  Hey  I understand the increase in size..but how about making Audible a CHOICE.. you can add it or make it optional.  If you take away Bluetooth support and Audible..maybe we might gain some space back.  (Personally I use nice plug-in headphones.  I really only see Audible BT when on a long drive in the car..like music.  But then again, you can just put it in a format like MP3 and play it thru the car.  I have the entire Hitchhiker's Guide Radio Broadcasts like that)2- BIG (to me ) BUG  the issue?  as in the photograph.. I use Amazon Cloud Collections.  I organize my ebooks (most I got before I got the kindles)  using Calibre.  So  when I set up series, I use the Series name, or I use the Author, or Subject as a title for the Collections.  sometimes, (as in the case of the Dune series), books are added that happened in-between earlier books that came out.  So when that happens I will add the book. And when you have a series of say 11 books, 9 of which came out years ago, I'll add the book as the following:  01-Dune  02-Dune Messiah  03-Children of Dunethen 3 books were added.. Tales of Dune. Paul of Dune, and The Winds of Dune.In my older 7th Gen PW it showed like this:  00-Tales of Dune  01-Dune  01.5-Paul of Dune  02-Dune Messiah  02.5-the Winds of Dune  03-Children of DuneBUT, As the photograph shows, the new 11th Gen PaperWhite has a bug!  00-Tales of Dune  01.5-Paul of Dune  01-Dune  02.5-the Winds of Dune  02-Dune Messiah  03-Children of DuneThis should REALLY be addressed!3-This is not so much a Kindle PW issue, as so much it's an Amazon issue.  and it deals with the Amazon Cloud Collections.  As I use Calibre, and I have a LOT of books that were originally Epubs, I used Calibre to convert them and organize them into series.  And after various different methods, including sideloading from the computer, I decided to use the Cloud Collections.  So I sent ALL of my converted epubs (now mobi files) to Amazon and used the website to organize them into the collections.  Which went very well ....at first.First..about 2-3 years ago, Amazon removed the ability to send the Collection to Device.  So now I HAVE to use the actual PW to get my Collections onto my Kindle.  Recently, Amazon changed the display format on the pages  on how they show books and doc files. And if you want to add a book or doc to a collection, it's now incredibly tedious! Formally when you did  a box would open that would let you start typing the name of the collection, or make a new collection.  All in one box.  NOW, a box open which shows 2 or 3 collections.. not in any order other than Recent..with a check box!  You can't find the collection by typing the title.. you can only scroll..and it only shows 2 collections at a time.  That's fine if you have 6 collections.. but I have 49 page of 5 COLLECTIONS EACH!!!  PLEASE PLEASE PUT BACK THE OLD WAY OR ADD A SEARCH OPTION!!  You've actually found a way that is so much more tedious than the actual Paperwhite!!!!! you can't even make a new one on there.. you have to go back to the collection Tab.. THEN go back to the doc or book tab and start all over!  Please go back to the old way !!!4- the new Library Series option.  It only works for purchased books, not docs.  also, I had to call up because it grouped two books together, in a series..(nice), but then stuck on e of the GRAYED OUT, above the first collection.. only in Download.  I found out I had to do a Reboot after turning Library option off. (I ended up putting the two books in a collection.. like I like.Well  that's about it.  btw  I  ALWAYS use the LIST vs GRID option.. and using HOME is no longer a nice choice.  I prefer when HOME was the same as LIBRARY .. in my case..the first collection, and all the collections after which comes the books in Recent ordernow... waiting for a dark brown cork case.______________________________________Slight update or comment on the software version.  My wife and I both upgraded to the 11th Gen.  Her's came with her case..Amazon Black Leather,  while I wait for the cork.  Her 11th gen came with 5.14.1 1,  while mine came with 5.14.0 .  I was a bit surprised since both were ordered at the same time. And arrived together.  But, not a big issue, since eventually all units will be on the latest software.  So? What to do?  I've read a LOT on here about complaints  it's so hard, I know.Since my \"update\" was grayed out,  I just downloaded the latest version and put it on my 11th gen,  and rebooted..and BINGO!  No problem,  I now have the latest software.Now fix the real BUG I addressed and fix the \"Manage Your Content\" pages regarding using Cloud Collections.  Oh, while you're at it, fix the damn Amazon Android App so I can work with Cloud Collections via the App. And not just my tower.  Thanks", "title": "a lot nicer than 7th gen...but a bug exists", "location_and_date": "Reviewed in the United States 🇺🇸 on November 10, 2021", "verified": true, "rating": "4.0"},
{"asin": "B09RD7XM9X", "text": "I enjoyed my 2013 Kindle for the last 9 years. It is what basically got me into reading as an adult. Up until now, I never saw a reason to upgrade. I got the previous model last year. It had the Bluetooth and water resistance. Two features I could care less about. If I'm going to listen to audible, it's because I don't have my paperwhite with me. As far as water, I've always had a sea to summit device bag to protect it if I wanted to do a little hot tub reading. But aside from those two features, there wasn't much new. Even the response time was near identical despite eight years apart. It wasn't enough of an upgrade to keep, so I gave it to my mom.One year later, my desires have been answered. Larger screen, faster response, warm mode back light. This one is much faster than the previous generations. It feels so much better to have pages turn when you tap the screen rather than 1.5 seconds+ later.For what to buy, do not waste your money on the ad free version. It doesn't get rid of suggestions that appear below your book list. It just adds a swipe to open prompt when you open the cover. And frankly, I HAVE bought books before that appeared there. Plus it also adds a little protection to accidental touch. To pay a one time fee on something you're already buying to remove ads from the platform you're basically required to buy books from is fairly hokey. But whatever.I love the new warm light feature. You can set it to follow your local sunset schedule, which is nice. It overall gives it a nicer reading a real book under incandescent light feel.The wider screen is a nice addition. I don't know if this is a complaint because obviously I don't want the device bigger. But my reading in bed while laying down is harder because I used to grasp it on the edges. Now there's no real edge to speak of, so keep that in mind.Main reason for one removed star is the battery life. I finally recharged somewhere in week 5 when I got into the teens. For the record, I don't turn off wifi when I'm not using it. I like to turn on hotspot on my phone and have my kindle quickly sync reading. I also never did on my old one. That one lasted a solid 2+ months for years. This one does not appear to have that longevity. For the record, I do not have the power save mode turned on. I found it to be way too obtrusive. You have to wait a few seconds for it to wake up when you bring it out. But the biggest reason was, while I always have the backlight set to like 5-10 brightness and medium warm, during this wake up, the screen would be bright and full white. This is not something I enjoy when I am trying to get to sleep. So I sacrifice battery life for that experience. Keep in mind, my old model didn't even have a battery save feature. So I'm not sure where that life is going.In conclusion, up until this year, unless you had managed to break yours, I wouldn't have recommended an upgrade unless you really need the Bluetooth or water resistance. This one, however, has definitely sold me. While I wish there were more user controlled features and settings, it's an overall great experience.", "title": "A worthy upgrade.", "location_and_date": "Reviewed in the United States 🇺🇸 on May 24, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09RD7XM9X", "text": "Kindle Signature Paperwhite plus Charging StandI own the 11th Gen (newest model 2022) standard Kindle Paperwhite and the Signature Paperwhite. I love them both. If dough is not the issue, I would buy the Signature model for fifty bucks more. Here’s some of my particular findings in use.Cases: Note that I do not like the Amazon cases because I don’t like folding over cover type cases; I prefer cases that simply help with holding the device.  I purchased the “MoKo Case for 6.8\" Kindle Paperwhite (11th Generation-2021) and Kindle Paperwhite Signature Edition, Ultra Clear Soft Flexible Transparent TPU Skin Bumper Back Cover Shell, Clear” from Amazon and it fits the Kindle ideally, and most importantly this case DOES go on the proprietary charging stand made by Anker and the charge does go through the case (that is, I do not need to remove the case to charge the Kindle in that charging stand).Battery: Amazon states that the Kindle 11th gen will hold a charge for 10 weeks, when used at limited brightness for 90 minutes a day (and a lot of other stipulations, like WiFi and Bluetooth off, etc). In reality, many may turn up the brightness, read more than 90 minutes, and Airplane mode on, or use other features that drain the battery faster (See audiobooks below). I have found that my battery drains faster than 10 weeks, but I am using the device with Airplane mode off, Wifi on, Bluetooth On. I do not like turning off wifi in particular because it MUST Be on to sync books between devices, and since I have two Kindle 11th gens, plus a MacBook, iPhone, iPad, and I read 5 books at a time simultaneously, I have no desire to turn wi-fi off.  Thus, having Qi charging is helpful…not mandatory but helpful.  Another BIG reason for the Qi charging is Audible audiobooks. I do listen to them through the Kindle itself, and the battery drains fairly quickly when listening to audiobooks.Memory Storage: The Kindle has 8 GB storage, but only 5.8 GB after their software OS.  The Signature Kindle has 32 GB storage, but only 28 GB after their software OS (there is slightly different software between the two models as the Signature supports more menu and charging features). So if you love downloaded “off-line” reading, and in particular if you enjoy having audiobooks in your downloaded library (they take much more storage than an e-book), the 32 GB is reassuring.Auto-light adjust: I can’t even detect that it’s doing anything, but if one rides a train daily to work and it passes through dark tunnels, this feature may be of benefit to you.Advertising free: Many forget the $20 value of the ad-free that is part of the Kindle Signature.  Even those that wouldn’t pony up for it on their own may enjoy it here as “icing on the cake” for the price difference.  I like seeing my own book cover on the sleep screen, and that is not possible with the “with ads” version. I thought I enjoyed the ads for editors choice books and book sales and stuff, but I much prefer the ad-free model.  And, little discussed fact, the ad-free version has one less swipe to get to your Library or current book every single time you turn on the Kindle. True!Dedicated Signature Charger Stand: I bought the Qi charging stand and like it greatly.  It does work with my “MoKo Case for 6.8\" Kindle Paperwhite (11th Generation-2021) and the Kindle Paperwhite Signature Edition, Ultra Clear Soft Flexible Transparent TPU Skin Bumper Back Cover Shell, Clear”., and charges through the case and the case fits the stand (but not quite as bump-proof as the Kindle without the case). I like that the stand sits quietly on my desk as I am working, or on my coffee table while I’m watching sports do I can read during commercials. I do not need to keep the AC cord attached to the stand at all times; sometimes I use the charger stand as simply a free-standing stand for either of my Kindles. I like that it can hold my Kindle 11th generation normal edition without Qi charging and I can read on it as an easel stand.  I feel the utility as an easel stand is underrated. Qi chargers in general are not free, and neither are easel stands, so coupling those two together, you get the price of this Anker model.  I find no issues with the size of the “wall wart” or the plug in the back of the stand. Some people complain with the charging stand that the white light indicator does not turn to another color, such as green, to indicate full charge.  A “work around” for this is to place the charging Kindle on the stand upside down; now the LED light at the bottom of the Kindle device itself, which does change color when fully charged, is face upward and easily seen. Frankly, there is no issue with simply assuming the Signature PW is charged after an hour or two. I like this stand much more than I thought I would.I’ve owned every Kindle since the first one! I use library Libby, and am an Audible and Kindle Unlimited subscribers. I guess you could say I’m a “power user”. I definitely prefer the Signature version, but both are good readers.  If I could change one thing about these Kindles, it would be to add a physical button like the Oasis. I realize that sounds outdated, but to reach and switch with the other hand, or reach thumb across screen to scrub, every page turn is a chore that is solved with an under-thumb button like Oasis. Additionally, the e-ink is good, but after two decades, one would think the text versus background contrast would be better…that is, darker text, whiter background. Instead, it remains darkest gray text in lightest gray background, not ideal.  Happy reading!", "title": "Kindle 8GB versus 32GB", "location_and_date": "Reviewed in the United States 🇺🇸 on March 19, 2022", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I finally treated myself this  year to a Kindle.  My girlfriends love their kindles and I thought I like holding a real book, which I still do, but I am traveling a lot this year and needed a couple of books and don't want to lug around.  This kindle is light, the battery is crazy strong.  I can go a week without using and the battery still holds a charge.  I have had it 3 months and the light on it is perfect and can be adjusted.  The touch screen is very reactive and I love that I can look up vocabulary and history background on the books I have read.  Holding it is easier than an ipad also.  Ipad weighs more and the light is not good for reading outside.  Took it to the Bahamas and was outside in the bright sunshine and no problem reading.  It is just like reading a paper page.  Lots of settings that allow you to customize it to your needs.", "title": "Thought I could read books on my Ipad...but the Kindle is Much Better!", "location_and_date": "Reviewed in the United States 🇺🇸 on July 21, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "The first thing I thought of when I saw an e-reader was AWESOME! But that was before they introduced the paperwhite models. In essence, they were amazon branded android tablets. They were slow and clunky and incredibly cheap. I'm further embarrassed to admit my first e-reader was actually a Barnes & Noble Nook. Which - if anything - was worse than the original Kindle's.I also discovered that I just plain missed holding a book. I couldn't explain it but I know a lot of people understand what I'm talking about. There is just something about being able to physically hold that book in my hands that just felt \"right\" and the e-readers just did not provide that.Finally amazon introduced the paperwhite and that was an absolute game changer. The ability to read a Kindle in direct sunlight was just unheard of. The older color versions were essentially useless in direct sun, or even marginally cloudy days as well. I still preferred holding a book in my hands though. But that all changed one night when I couldn't sleep and I tried to read at 1am and couldn't get ANY light to work well enough while also trying to hold my hard back book and not wake up my wife. It became a challenge of monumental proportions (at least for me it was). Slowly, over the course of the next 6 months, I began to warm up to the idea of giving the Kindle another try.This is where I made a big mistake however. Instead of buying it new, I went with a reputable company that sold reconditioned electronics for a deep discount. My reasoning seemed solid (at the time), if I ended up not truly enjoying my Kindle, at least I hadn't wasted too much $$ on buying a new one. Unfortunately, the model I received was tied to the account of the former owner, and I wasn't able to correct that with a simple master reset. It took several days to work thru that problem, but once I did, I was off and running. I got a slightly smaller model (6\" screen) and while it functioned, it stuttered so often I forgot just how smooth it really should've been. But still, even with the issues, the hiccups and stuttering, I grew to really enjoy using it and more importantly, I loved the battery life it offered.I decided it was time for an upgrade, and this time I was going all-in. I got the 6.8\" screen, which isn't that much bigger, but it DOES make a difference. Since I ordered directly from amazon this time, imagine my absolute surprise when I turned it on I was worried that it was going to take forever to link up to my WiFi and have to add my amazon account information...but that did not happen. Not sure if amazon pre-programmed it, but as soon as I turned it on it said, \"Welcome Jeff\" and I was stunned. How did it know???  Well, no matter, the set-up was a friggin' breeze and I was thrilled how seamless it was.Operation was so much easier and while it still offers a little stuttering (which in all honesty is simply due to the black & white screen and how it operates) but it was decidedly better than the older model. Battery life is stellar, though not as good as amazon claims. I think what they say is almost absurdly optimistic. But, the truth is, a paperwhite will give you pretty great life on a full charge.It operates well, and I love how I can invert the screen so more of it is black. Not sure if that uses less battery like it does on an amoled phone screen, but I'm going to see and test it just in case. My old Kindle did not have this option.All in all, reading is fun again for me and I love how I don't need a special light to read in the middle of the night like I did with a hard back. Kudos to amazon, I love my Kindle.", "title": "Reading Is Fun Again", "location_and_date": "Reviewed in the United States on March 23, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I'm finally upgrading from a first-generation Kindle Paperwhite. I loved everything about the device and thought a slightly bigger screen would be kind of nice. To my surprise, the increased ppi is very noticeable and welcome. The screen lights evenly and the increased size is pretty wonderful. It feels more \"real book\" size. The battery life seems excellent. One of the biggest nudges for me was that my old Paperwhite was starting to fall short. I would have to charge it after every book or so. The new one (Refurbished) used about 20% for a Brandon Sanderson book. Those are pretty quick reads, I would figure that was about 8 hours of use. Much better than the old one.My biggest complaint is that they went away from the inset screen, with the portion surrounding the reading area being part of the front screen. Fingerprints love it and it's easier to accidentally get them on the reading portion. The back also seems prone to acquiring a scuffed jean like appearance on the corners. At least, that's what I can figure from the refurbished one I received. It is why I moved to a new one. I didn't have any issues with the use of the refurbished model, but I'm unsure how much use is required to put those kinds of marks on the device, and would like to keep this one for a very long time.The comfort of holding the device is perfect. I didn't actually want to buy another e-reader. I have a 10\" Boox Note Air that reads great, but is awkward hold for casual reading. The size here is perfect, and I'm satisfied for the price.", "title": "Almost exactly what I wanted.", "location_and_date": "Reviewed in the United States on July 12, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09RD7XM9X", "text": "I have refused to switch over to ebooking for YEARS! There’s something special about holding a real book and turning real pages. I love the smell of books and the satisfaction of the aerial view of my bookmark make it’s trek towards the last page. You will not get this satisfaction with a Kindle, however what you do get is more practical. I love this Kindle when I read at night while lying in bed. Im not talking reading in bed, sitting up with the lights on. Im talking laying in bed, with the covers pulled up to my chin, all the lights off and my twisty flashlight reading light wrapped around my neck. With a Kindle, there’s no more adjusting my neck flashlight to hit the page in the right spot without shining too much light on my sleeping husband. No more flashlights at all! No more forcing my wrist into uncomfortable wrist-yoga poses to keep the pages open and at the best angle, especially with those super wide/lengthily books. I absolutely love it. I also saw a hack on TikTok where you can get a clicker to turn the page for you and a little arm that attaches to your bed/nightstand and will hold the kindle in place for you so you can have all your appendages comfortably under the warm covers and still be able to turn the pages. That will definitely be my next luxury purchase. I miss books and pages and all that, but it really is worth it. I also just got back from vacation and it was so much easier bringing my kindle instead of a few bulky books. And it was nice because the book I started reading I ended up abandoning in a few days and I just downloaded a new book. Also love using the Libby app to get free ebooks from my library that I can easily read on my kindle now. I also got this specific model for the waterproof feature so I can read in the bath or jacuzzi, but I haven’t actually tried that yet.", "title": "Total Kindle Convert", "location_and_date": "Reviewed in the United States on July 9, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "My experience with the 16GB Amazon Kindle Paperwhite has been largely enjoyable, and it’s brought a renewed sense of enthusiasm to my reading routine. However, there are a few points where it could be tweaked for an even better user experience. Here’s a 5-star review, with a few friendly suggestions for improvement.A Pleasurable, Bigger Display 🖥️📚: The 6.8” display is significantly larger than in previous models and has transformed my reading experience. More words per page translate to fewer page turns, which contributes to a smoother flow in my reading. The sharp resolution mimics the look of printed text, combining the comfort of a physical book with the convenience of an e-reader.Customizable Warm Light, Easy on the Eyes 👀✨: The adjustable warm light feature is a game-changer for long reading sessions. It allows me to fine-tune the screen’s warmth to match my surroundings, reducing eye strain whether I’m reading in broad daylight or under dim lights before bed.Compact Library in Your Hand 📚🎒: The 16GB storage is a bibliophile’s delight. It allows me to carry a wide range of books without the weight or bulk, perfect for travel or when I’m just in the mood for options.Sleek Look, Comfortable Grip 🕶️🖐️: The black design exudes elegance, and the rubberized back and smooth bezel around the screen ensure a comfortable grip for prolonged reading.Battery Life Worth Applauding 🔋⏱️: Battery life is outstanding in the Kindle Paperwhite. It easily lasts for weeks on a single charge, making it an ideal companion for commutes, travels, or for avid readers who go through books like wildfire.However, there’s a small aspect that may not appeal to everyone:A Bit on the Heavier Side ⚖️🤔: While the larger screen size offers an enhanced reading experience, it does come with a slight increase in the overall size and weight. For those used to the feather-light feel of earlier models, this change could take some getting used to.All things considered, the Kindle Paperwhite 16GB confidently lands a 5-star rating 🌟🌟🌟🌟🌟 from me. Despite the minor size and weight adjustments, the brilliant display, adjustable warm light, ample storage, refined design, and excellent battery life more than compensate. If you’re a book lover like me, I highly recommend giving this Kindle Paperwhite a go! Here’s to countless delightful reading adventures! 🎉📖🍻", "title": "📚 Kindle Paperwhite: A Delightful Read with a Few Tiny Hitches 🌟", "location_and_date": "Reviewed in the United States on June 22, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I just absolutely love the Kindle Paperwhite. I had an older version from about 2017, but I lost it and I’ve been sad about it ever since. I finally decided to treat myself to a new one, and I am SO GLAD I did! The screen seems larger than my previous one, and the device might be slightly thinner too. I’ve always been a big fan of the look of the paperwhite screen. It definitely feels like you’re reading from a book and not a tablet.A couple new features I like that I didn’t have on my older version:- The screen gets brighter than my older version, which is GREAT! I always felt like I wanted just a bit more brightness sometimes.- You have the option to change the color/temperature of the screen to warm or cool options, so you can reduce eye strain at night with the warmer version.- This may be due to the case itself, but I purchased a super thin snap-on case for both this kindle and my last version, and this version of the Kindle is INCREDIBLE because it doesn’t accidentally lock when I move the folded back cover of the case when reading. Previously, I would fold back the cover of my case behind the kindle, and if I accidentally shifted the folded cover, it would trigger the magnet to lock the kindle. Now, I don’t have this issue AT ALL, even when trying to recreate it.", "title": "Book Lover’s Dream", "location_and_date": "Reviewed in the United States on June 24, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "My wife is an avid reader. I’d say she would reads about 6-7 800 page books a month. However, her book buying is at a much faster rate. All 4 walls in our office room have bookshelves and they’re all full of books and they have been occupying some of the family room now too. Well, we’ve moved a couple times and I’m getting older with the usual back pains and moving a box full of books is not easy. Plus the amount of space they take up is a little too much at this point. So I bought her this Kindle with a 16GB SD card and told her that it can hold over 16,000 books. She also likes to read in bed at night and used to have to have a light on while she read, which would keep me up sometimes. With the Kindle’s backlight being adjustable and the text being able to be changed to white text with black background makes for an easy read. I would highly recommend this model compared to the others just for size. My wife is 5’0” and she can grip the kindle with one hand.", "title": "Wife’s New Obsession", "location_and_date": "Reviewed in the United States on July 4, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I had been holding off on purchasing a Kindle or any e-reader because I love holding a book and flipping pages. However, it's not always easy carrying around books and space fills up quick. The kindle is light weight, easy to take with me on trips, and it doesn't take up a lot of space. The format of the kindle is easy to use for me and I think it does it's job nicely.It does take some getting used to, especially the slight lag when switching pages but other than that I think it was worth my money.Be careful though if you sign up for the 3 months free Kindle Unlimited and don't plan on continuing the subscription. My best advice is set a reminder a week before it renews to remind yourself to cancel!The most important thing was also the battery life! It lasts for a long time and I've only had to charge it once or twice since purchasing it a couple months ago. I will say I'm not constantly on it, but even with it sitting it doesn't drain the battery life fast.", "title": "Easy to use and does it's job; insane battery life", "location_and_date": "Reviewed in the United States on July 5, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "This is my first Kindle and I absolutely love it! I used to love paperbacks but the ease of this product has switched me to Kindle only. I was worried it may be too big but it is a perfect size for my hands and easy to hold/grasp. The battery life last so long, I read all day and haven’t had to charge it in days. It’s easy to work and has great lighting features. It really does look like you’re reading a book. It has great customization options too for the text you’re reading. You can even add a passcode if necessary and you can set the cover of the current book you’re reading as the background of the kindle which makes the kindle look even more like a paperback. I recommend this to anyone who likes to read or wants to get into reading, it’s addicting! I’ve been reading daily since this was delivered.", "title": "Perfect for readers", "location_and_date": "Reviewed in the United States on July 21, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "This is the best purchase I’ve ever made. So many years I have too myself that a kindle is a waste of money and I finally decided to do the splurge. First off, reading outside has never been easier, it’s like an actual book with no glares that a phone or an iPad would have by being outdoors. This is probably one of my biggest reasons why a kindle is so amazing. 2nd- I can read in the dark. I love to read before bed to make it easier for me to fall asleep, but I hate turning off the light afterwards. 3rd- books are way cheaper! I downloaded an app called Libby and I rent my books through the library and don’t even have to go in person. I just download it online. I never have to buy a book again with this.4th - can fit in a purse and it’s very light weight.5th - you can customize it with stickers and a case6th - it’s good for your eyes. You can read for hours and not feel a headache or have a strain in your eyes.7th - at this point in suprised you haven’t downloaded this kindle in your cart.A little hints I heard that the kids paper white kindle is exactly like the adult version. You just need to take off the kids setting. Also, don’t pay for the adds to come off, if you call amazon tech support they will do it free. I had mine taken off bc it was showing sexual content on my screen and I personally just didn’t like that. They have no way to  make your adds kids friendly. But if you don’t call them honestly the adds don’t even bother me. They don’t pop up when you read, they only pop up on the main screen when you turn it on.", "title": "So glad I bought it", "location_and_date": "Reviewed in the United States on June 24, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I’ve had this eReader for a good 2 months now and wish I got it sooner. I was cheap or trying to be frugal by reading on my iPad or phone. It totally makes a difference! This is one of my most used devices. I take this with me wherever I go!I love the agave green, the ease of use and its battery life. I’ve honestly only charged it twice or thrice since it arrived. I keep it on dark mode 90% of the time because it’s just what I’m used to (I do this on my phone too).I bought the kindle fabric cover and a clear backing-only case and like them both. The clear one is great for personalization. I’ve only added a grip because I love the clean minimalist look, but who knows, I may end up adding stickers in the future.If you buy the version with the ads, you have the option to remove it later, like I did. I have a kindle unlimited subscription but I also use my state’s public library system and borrow books through the Libby app.This purchase was SO WORTH IT.If you’re considering getting one, I’d highly recommend it. You’ll find yourself reading 5-10x more than you normally would without it. I’m just speaking from my experience. I’ve always been a bookworm but since getting it, my reading has been on a whole different level.", "title": "❤️", "location_and_date": "Reviewed in the United States on June 24, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "Overall I'm pleased with this Kindle. It's a replacement for a really old Kindle DX that I honestly hadn't used in years. While the screen is notably smaller, the ppi is almost double. I prefer not to use my reading glasses, and I can get the text large enough to comfortably read. Works well in bright sunlight by the pool or in dim light with the lighting turned on. Can read for hours at a time without any eye strain.Touch screen to turn pages works reasonably well. Every now and again I might touch the wrong place or perhaps double tap and I'm not where I expect to be, but that happens infrequently and isn't really a concern. I didn't pay extra to remove the ads, but they're not anything I even notice anymore. There's something on the screen when it starts up, but after the swipe to get started you never see any ads again. Certainly not worth $20 extra to remove that, and even then there's still extra stuff there.My public library has most every book I've wanted to read available as a kindle download. I download a number of books at a time (integration between the library's site and amazon's works very well and there's never a problem getting the books to the kindle) I then turn on airplane mode on the kindle and use the library's website to return the books. I can then read the books for as long as I want. When I'm finished with all the books I get another batch from the library.Battery life is reasonable, but not weeks. At least not if you use it for a few hours a day with the light on. I might get a week of usage before charging it again, but that's not unreasonable.I found a nice heavy, embossed, real leather cover for the kindle elsewhere that I've been happy with. Nice feel and it protects the device well (Oberon Design)While I thought I would have preferred something larger like my previous Kindle DX, this size just fits in cargo pants pockets or an overly large shirt pocket I have on some of my shirts. I'm able to keep this with me at all times to be able to read something when I have a bit of extra time.If you enjoy reading and want to be able to bring a library with you most anywhere, this is a really good Kindle.", "title": "Easy to read in any light conditions", "location_and_date": "Reviewed in the United States 🇺🇸 on May 29, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I have had this for about 1 week.The battery life has been good so far. I like the USB c connector. It allowed me to get rid of my USB A to mini cable. When I got my Kindle it updated twice to bring it up to date. It easy to hold. This my first  Kindle without the page turn buttons. I have had no issues with turning the pages by tapping the lower right/left  corner. I strongly suggest a case. It helps me  hold the reader and protects the power button from inadvertently pressing it. I went with allowing the ads and like others have indicated it is no real problem since they only appear on the startup page.  I feel since it saves $20 it is ok. I have always spent the $20 to avoid the advertising. It is a worthy upgrade over my old Oasis.", "title": "Great replacement for my Oasis.", "location_and_date": "Reviewed in the United States 🇺🇸 on July 18, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I don't like upgrades. Every time I'm forced to get some new piece of electronic equipment, I dread the experience. I still haven't switched to Windows 11, even. Tried it once, couldn't delete it fast enough!You have to understand, I've only had one Kindle, and it's about 12 years old. I took good care of it, and had to replace the battery once, but it still worked.  Sort of. But turning pages took longer and longer. Often, it took so long, poor Kindle would just send an error message and give up. I wasn't even able to open some of the newer books. The replacement battery was losing its ability to hold a charge. Even worse, my Kindle case was literally falling apart, but my Kindle was so old, I couldn't find a replacement.So when I could postpone the inevitable no longer, I ordered the 11th Generation Paperwhite.When it came time to actually make the purchase, my palms sweated madly, but discovering the 16G was on sale—making it cheaper than the 8G I'd decided was more financially affordable—cheered me right up. Getting a trade-in that equaled one payment, and receiving a gift card that pretty much covered the cost of a new case, made it even better.The new Kindle arrived on time, and I was actually excited to try it out. There was just enough power in the battery to set it up before it needed charging. I'm quadriplegic, so the touch screen was a welcome change. I worried I'd be constantly swiping and wearing out my arm, but a tap is enough to turn pages. I like the lighted backscreen, which I didn't have before, and the wider size is easier for me to hold.Someone complained about the edge being too narrow to hold on to, but that's what the cases are for. I wouldn't recommend trying to use this product without a case to cover it. Not only does it protect the Kindle, but it makes it much easier to hold. I really love the way this Kindle sleeps when I close the cover, and wakes when I open it.I'm clumsy from nerve damage, so I sometimes touch the screen by accident, causing it to skip pages. But this device is so fast, I find my place again without difficulties. That was one of the things I worried about, before the purchase, but it's not a problem.What I don't like: the clock down in the bottom left corner. I turned it off, and when I briefly looked at another book, it turned back on again. When I turn something off, I want it to STAY OFF. And if I don't like it for one book, then I don't want it on any books—but you have to turn off each book separately. And apparently, if you leave the book for any reason, then you have to turn it back off, AGAIN. When you've got issues with hands/arms, any extra click is too much.Let me turn it off in the device for ALL books, please, not just one book at a time.The other thing I hate is the way collections are managed. Before, when I added a book to a collection, that title was taken off the list. Now it stays on the list, so I have to scroll through EVERY book on the list, EVERY TIME. Since many book titles are similar—especially books in the same genres—that gets very confusing, very quickly. Not to mention, it's time consuming. Especially if you own over 1000 books!Just let me add a book to a collection, then take it off the complete list. Maybe you think I want to put it in multiple collections, Amazon, but I'd trade that option for ease and simplicity of use, any day.Also, I can't seem to get the highlight function to work. When I try, all I can get it to do is make a note. I've gone through the Kindle guide several times, and I've also searched online for an answer, but I can't find anything to explain why it won't give me a way to save a highlight. I often highlight passages to read to my sister; I don't want to make notes about them, just read them to her!Overall, I'm very pleased with this product. There are just a few, small annoyances that I'm apparently going to have to live with, I guess. I'd really, really like it if—just once—a new product kept all the good features and only 'improved' the bad ones. It's all about choice. Most of my unhappiness stems from the loss of a choice that I considered crucial.If Amazon had just left those easy little things unchanged, and given me the choice to do things the way I had become accustomed to doing, this would be a perfect product.", "title": "Mostly Pleased but Small Things Annoy", "location_and_date": "Reviewed in the United States 🇺🇸 on February 10, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09RD7XM9X", "text": "Believe it or not, I prefer reading books on my Kindle now than reading an actual book. I must not be an avid reader, right? Heck no. I consume 8-12 novels a month and have stacks of hardcover/paperback volumes around my apartment, but that’s what I love about the Kindle. It’s SO lightweight. I don’t have to worry about hand cramps. I don’t have to worry about reading in a dark room (a game changer). I even went out and got a library card because I can check out e-books from my local library, which has saved me so much money. Also buying books in general is monumentally cheaper (which I still do if I read an e-book and loved it). I NEVER thought I’d love an e-reader as much as I do, but I’m a convert. Took a few hours to get used to at first, but the screen isn’t like an iPhone screen, if that makes sense. It’s not a slick, colorful surface. It has the tiniest bit of texture and is black-and-white, so I don’t feel in my eyes/head like I’m staring at a screen all day. The battery life lasts DAYS, maybe even weeks. Honestly I can’t think of a single negative. I love my Kindle and can’t recommend it enough.", "title": "OBSESSED", "location_and_date": "Reviewed in the United States 🇺🇸 on July 12, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "After buying my Kindle, I read 18 books in 1 month (most 500-800 pages each). It is convenient, easy to use, and the battery can last up to a few weeks depending on how much you're using it. I absolutely love my Kindle and consider it to be one of my best purchases because it significantly increased my reading. I love that I can read in bed with the lights off, making my Kindle dim enough that it won't bother my husband while he's trying to sleep.Flipping pages by dragging your finger can be a bit delayed (or just somewhat slow), as well as searching through the Kindle store. However, I haven't been bothered by the speed, just noticed it.I am an avid reading and LOVE a good physical book, but nothing compares to the ease and convenience of using a Kindle.", "title": "Battery last SO long!", "location_and_date": "Reviewed in the United States 🇺🇸 on July 11, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "What can I say I love to be able to read at the end of my shift and at night before I go to bed and I can do so with this device and watch nice as I can pull down articles and even the constitution which I have on this device Down I have books that I had years ago linked to this device and I can read them and right now I’m reading a Mech warrior book and the clarity is great. I took this unit outside in the bright sunlight and Bam perfect clarity, so yeah you can have an iPad. You can have an android pad, but having a paper is awesome , you can get over 10 hours of battery life I was a bad boy and if you turn off the back light when you’re in the sunlight reading this, you can probably get even more. I highly recommend this unit because if you want to read books if you want to read good fiction like I do and this is it  Hopefully one day my books will be on here as I published under wicked sky a few years back, and I hope that people read that because the next book I write and publish on Amazon will be alien ocean. Get this unit cause it’s good go for it!", "title": "What are you awesome!", "location_and_date": "Reviewed in the United States 🇺🇸 on June 27, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I love Kindle Paperwhite. I bought the first generation one back in 2013 and it has accompanied me for almost 10 years (still working and in perfect condition), so I was very excited to get the newer version in one of my favorite colors. While the functionality is as great as expected and I love reading on it, I decided not to buy a case until I found a clear one to be able to show off the color. I have been extremely careful with it, have only used it for a max of 5 hours, but the backside already has some stains that have proved impossible to remove. I have no idea how they got there and I have found several threads on different forums of users with the same issue, both while keeping the kindle in a case the entire time or without using a case at all. It seems this material is very easy to stain, whether it’s from other materials or just fingerprints and heat in general, which is why unfortunately a case is not a solution. The various stains on this are also impossible to remove according to online communities, so you either learn to live with them or get a case to cover them so they won’t bother you, knowing it might look worse whenever you decide to take it off. I have tried rubbing alcohol, stain remover, soap, eraser, and all other solutions possible and they don’t come off one bit, so I decided to store mine in the plastic bag it came in, while I find a case that I like enough that covers the back, but this is a big let down, hence the 4/5 stars.", "title": "Love it but backside is easily and irremediably stained", "location_and_date": "Reviewed in the United States 🇺🇸 on July 3, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09RD7XM9X", "text": "I love my Kindle! I have been against reading books on an electronic device for years, but since I am traveling for the next 4 months, I decided to cave in and purchase one. BEST DECISION OF MY LIFE! I have literally read 10 books within the past 3 weeks, which is more than I read all last year. The Kindle makes it so simple to access books. I love the size, as it's not too big, it's easy to read with one hand, the changeable lighting and font size is great for switching on reading during the day vs. the evening. My only complaint is that sometimes when I am holding it, depending where your hand meets the screen, it can change to the next page. But what a great investment! I purchased it when it was discounted (by luck) and also received 3 months free of Kindle prime.", "title": "Obsessed", "location_and_date": "Reviewed in the United States 🇺🇸 on July 11, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "My first Kindle a year ago was the  basic model. Now I pretty much never read paper books anymore. When the opportunity arose to upgrade the Kindle, I decided to go to the paperwhite. At a modest cost increase to the basic model, you get a few additional features which I find to be very helpful.First, I got the paperwhite because it has a yellow light mode and allows you to set it to be in sync with daytime and night time. I have been very happy with that feature.Second, I like reading in the bathtub and it’s nice to have a Kindle that is waterproof.Third, it is actually way less glitchy and software is smoother and more user-friendly. There’s an easy dark mode control, and the other controls are smoother.  There are plus/minus buttons for brightness, and I find that there is much less of a problem with Pages, turning in the wrong direction when I tap. Which was actually a big problem with the basic.A few things the description on Amazon‘s website did not cover:How much blue light is removed in yellow mode? All of it, or just a percentage?  It doesn’t say.If I was reading in the bathtub, and dropped the Kindle in to the water, would I get electrocuted? The marketing materials don’t say.Overall, I am extremely happy with the upgrade, and feel that this is worth the small extra expense over the basic.", "title": "A great upgrade from basic kindle", "location_and_date": "Reviewed in the United States 🇺🇸 on June 20, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I had debated getting a Kindle for a while now, but I am so glad I went through with it! It is so easy to carry around without the worries that come with carrying around physical books. It has a long lasting battery life, the brightness is very adjustable and easy on the eyes for reading at any time of the day, it has great features like tracking your reading speed and how much of the book you've gone through, highlighting passages, making notes, rating books after reading, and so much more! I also enjoy how it's compatible with the Libby app if you're not interested in purchasing the books via Amazon.Honestly, I thought I was going to miss the physical-ness of books, but the Kindle is just so much effective in so many ways. I've also read so much since I've gotten it!My advice: if you want to save yourself the space, cost, damages, and reading slumps that come with physical books, get yourself a new bestie... the kindle <3", "title": "Wow. Game Changer", "location_and_date": "Reviewed in the United States 🇺🇸 on July 10, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "This is my second Kindle. The last one was the previous Paperwhite model. I bought this thing so that I could bring as many books as I wanted to on my business trips. I fly a lot, and though I may watch one film, I am somewhat of a voracious novel reader, (one to two a week).Anyhow, this product really is close to perfect. The Paperwhite moniker is a good one:  this thing is as sharp and clear as paper at pretty much any angle, day or night. There's only one thing that I wish they'd improve. The power button is on the bottom in a spot where I often find myself wanting to hold it. Therefore I found myself accidentally turning the thing off for the first couple of months I had it. I've gotten used to it, but it does need to be relocated. Otherwise I wouldn't change a thing. That's why I gave it 5 stars.Here are a few things you might like to know:-You really don't need a case for it -- they're pretty heavy duty. I've had mine for a couple of years and there's not a scratch.-You can check books out from your library! I mostly do this, although I'll admit my free trial on Kindle Unlimited has me hooked.-The battery lasts so long that I don't bring a charger along on my trips anymore. Good for like a month!-Thought I would miss the visceral feel of reading actual books, but this thing is so darn convenient that I've forgotten all about hauling several hard backs around in my backpack.-Once you get the hang of it, it's super easy to use.-I'd buy another in a heartbeat, and you should too!-Happy reading!!", "title": "This is the one you want", "location_and_date": "Reviewed in the United States on July 4, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I decided to trade in my old original paper-white kindle for this version because I wanted better battery life and a usb-c charging port. I figured the new one would have a nicer screen, better back lighting, and I like the yellow tone as well.While these are all great features, there are a few things that I don't like about it. The home screen is cluttered, and it is difficult to discern if I'm looking at my library or the store. My books and collections all carried over, but it is still not intuitive to navigate. I'm not sure if my notes and highlights carried over though. I understand now why my grandfather has a hard time finding what he wants on his.The one feature that is missing, that I am truly incensed about, is the lack of support for crossword puzzles. This was a fun feature that was natively supported on my old kindle. I bought several volumes of the  NY Times Crossword Puzzles, and now I can't use any of them. You could touch a square and put in a letter, you could have it reveal one letter at a time as hints, and it would check your completed puzzle against the answer. It was a great way to pass the time besides reading. Please bring this feature back!!!", "title": "I like my old one better", "location_and_date": "Reviewed in the United States on July 4, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09RD7XM9X", "text": "If you enjoy reading, especially at night or on the go, a Kindle is definitely a must. I upgraded my 2nd Gen due to no longer being compatible.  I was reading  from kindle off my phone, but found it distracting and too small.Pros: dark mode for ease of reading at night without harsh lighting keeping hubby up; unlimited access to a library of books that I can waiting jump from one to the other; no worries about tearing pages or getting pages wet; no distractions from pop ups; love that I can adjust text sizeCons: I wish I could scroll pages/ text up and not just side to side; miss the feel and smell of an actual book; touch sensitivity can be too sensitive and will skip pages", "title": "Exactly what I wanted", "location_and_date": "Reviewed in the United States on July 12, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I got this on Prime day for cheaper than normal! I feel like it’s a great way to take a book anywhere and if you like to travel, it’s practical and convenient. It doesn’t lag too much and seems like it’ll hold a charge. I like how you can change the brightness and warmthThe things that bother me are the ads for books and amazon when the kindle is “sleeping”. I really am not a fan of constantly advertisements in my calm space. (I just found out you can pay a one time fee to get rid of them which I will be doing - but still annoying) The other thing that bothers me is how expensive ebooks are - many books I can get physical copies of way cheaper and support other businesses. I wish there was another way to get ebooks.But would recommend it if you’re looking for a way to read books conveniently without having to use the physical copies. It’s easy and can take it everywhere", "title": "good kindle", "location_and_date": "Reviewed in the United States on July 15, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09RD7XM9X", "text": "First, I want to clear up some confusion about airplane mode. Looking at reviews, I see complaints about battery life and the assumption airplane mode uses power. Wrong! Airplane mode means wireless communication is OFF. When you drive a car, the overdrive off light comes ON to tell you that feature is OFF. On a Kindle or phone or any device with airplane mode, that means the WiFi and bluetooth are OFF. (With a phone that also turns off cellular communication.)My previous Kindle  was/ is the paperwhite 8th edition. That Kindle recently started having problems like light not coming on, random restarts. So I bought this to replace my old PW before it quit working. This rest of this review is comparing this 11 gen vs 8 gen.This new model automatically puts books of same series into a folder. My 8gen simply showed all books in library. While reading there is an option to have a clock at top of screen, and time left to finish book at bottom. Time left is calculated from your reading speed. The adjustable light may be nice for some people, but for me I have it set to look like my old Kindle. There is a low power sleep option (device options, advanced). With this option enabled it takes a few seconds to wake up and use. I disabled that feature so I start reading when I want to. I have a third party ebook that takes about half a minute for 8gen to process, this new Kindle takes about 6 seconds. To transfer my content I plugged both Kindles into my PC. Both Kindles came up as external drives. I found the folders where content is stored, then copy and pasted. That is also how I load PDF and other third party content. My old kindle was bought December 2014 and got a lot of use. Battery life on old Kindle is still good, and I always use airplane mode except when downloading a new book.Overall, this feels like a waste of money if old Kindle were reliable. The new features are not worth it otherwise. I was worried the smaller border would make it difficult to hold without touching the screen, but I have not had a problem. The border can be widened to reduce accidental touching. I am using my new Kindle with CoBak case. The one new feature i really like is the bigger screen with more text.", "title": "Airplane mode saves power", "location_and_date": "Reviewed in the United States on May 3, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I received this as a gift the year it came out. I absolutely adore it, especially because it lets me read in the bath and in the shower! I'm really busy so any chance I get to read is precious. Reading at night with the screen dimmed so I don't disturb my partner is also convenient. The kindle is so lightweight. I still love paper books deeply... but I cannot read them in the shower or with the lights off! The only thing I would change is to make the margins a little wider for easier one handed reading while lying down and/or making the page turning controls customizable so you can adjust them based on your reading position.", "title": "Lets me read in the shower!!", "location_and_date": "Reviewed in the United States on July 18, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I got each of my two kids one of these.  Ages 13 and 17.They had permission to read at night, but had to have a light on.  They have remote controlled lights.  and the rooms are side by side.  So when activated, it turns both on or off.  So, if boy's is off, and girl turns hers off, then the boy's turns on.  And if they are both on, then both go off.  Annoying.They both had a kindle and loved them.The one thing is that these now are so attached to the Amazon store, that it is often difficult to know whether a book is already purchased or if you accidentally just bought a book.  So Frustrating.But once into our own sizable library, they love the reading and the light.", "title": "Kids Love It", "location_and_date": "Reviewed in the United States on July 21, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09RD7XM9X", "text": "I used to think that changing to e-books would not be a satisfaying experience. However, I had to change for it because I am traveling quite often and it was a problem to carry many books in the luggage.So, I decided to give a chance to the Kindle and I do not regret it. The light of the screen is so smooth that even reading in darkness is not feeling tiring for your eyes, I could say that it feels even better than reading a physical book with a side-lamp.The only point that could be improved is the sensitivity to touch. Sometimes, specially while browsing for new books, the touch function is slow or innacurate. But, since the device is made for reading and not for browsing, this defect is something that you can live with.", "title": "Do not be afraid of change", "location_and_date": "Reviewed in the United States on June 30, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "It took my daughter giving me the hard sell to convince me to try this paper white. I was convinced I would miss holding a book in my hand and turning actual pages. I am a believer! The ease of this compact, easy to read kindle has me sold. I can carry it in me hand and slip it in a bag so I have my book whenever I have a few minutes. Love love that I can read outside in the sun and even with polarized sunglasses! Not a thing I don’t love about this, right down to the pretty green color I got. Just wish I took the plunge years ago!", "title": "Never looking back!", "location_and_date": "Reviewed in the United States on July 20, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I ordered a kindle to get back into reading. This is my very first kindle and I love the kindle paperwhite! The kindle is very light, so much so, that I was surprised at exactly how light weight it was . I love that I can read in the dark and other low light conditions with the adjustment of brightness and warmth settings. The device is easy to set up and is very user friendly plus the battery is amazing. I also subscribed to kindle unlimited in addition to this purchase and have found some amazing books and I’m on my third book in less than a month! I highly recommend this product!", "title": "Amazing!", "location_and_date": "Reviewed in the United States on July 10, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I was hesitant to buy a kindle because I’d had one long ago that was like a tablet and I found myself using it more like an iPad than for books.I bought this one with the soul purpose of using it to read and it has become one of my essential items before heading out. I love it.Pros:-battery life (it really DOES last at least a week. I read for hours everyday).-lightweight and compact-intuitive-customizable enough for your comfort (brightness, warmth, dark mode)Cons (if they can be considered cons)-no color (my friend did not realize this when she bought hers and was disappointed lol)-a little lag when on kindle storeI’m so glad I bought this. Worth every penny.", "title": "So Good", "location_and_date": "Reviewed in the United States on June 29, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "As my 7th Gen Paperwhite finally started having more and more issues, from freezing and a need to restart to issues with the USB power connection, I finally opted to get a new reader.  My timing was impeccable, as the 11th Gen was on sale.  I considered the basic, but there was just something about having water resistance that sold this Florida girl.ProsNo places for dust & other particles to hide, making it easier to clean the reader's surface.A larger screen.The warm light function, although that may take me a while to get used to.No major changes in usage, meaning no need to train myself up again.EDIT:  I forgot to mention the battery life.  I'm a bookworm.  I read ALL day, so with my 7th Gen I would be forced to recharge two to three times a day.  Experimented with my new baby.  From 12:30 at 100% charge and finished reading at approximately 9:30 pm with 90% left (with no wifi on).  Whoohoo!!ConsThe warm light timer function didn't work the first day I tried it.  It as supposed to have such off at 8 am, but was still on at 10:00 am.  Not a biggie, I have no problems at all doing it manually.About two hundred downloaded files had to be manually placed into their appropriate collection file.  No idea why, but 2/3 of the file's contents would up in Uncollected.  I really wish there was a way to move them in mass rather than one at a time.BIGGEST CON!  The power button is too damn close to the USB connection.  Even as small as my fingers are, I tend to hit the power button every time I connect or disconnect the reader.  Bad planning choice in my mind.So that's it.  I love the reader and like that I chose it for my new library.", "title": "I'm sold", "location_and_date": "Reviewed in the United States on May 13, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I was hesitant about Kindles until my sister purchased one years prior and showed me how great it is. I decided to purchase one on prime day as a treat to myself as I was celebrating an accomplishment. Best purchase! I’m so glad I’ve converted to the Kindle. I absolutely love it and been using it everyday. It came in great condition. The screen and features are amazing. The setup was very thorough and easy. I love how simple it is to transfer books from Libby/Amazon as well. It is very light to hold and bring with you anywhere. If you are a lover of books, a Kindle is a must! You won’t regret it:)", "title": "Best Treat Yo Self Purchase!", "location_and_date": "Reviewed in the United States on July 20, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I have had my kindle paper white 5th gen (2015) for awhile now but it started slowing down and the battery life is getting worse. I waited for Prime Day to upgrade to the newest paperwhite and I’m so glad I did. It feels so nice in my hands! It’s got a great screen size. I like the different lighting options too. It is also very fast and responsive. I shared two photos comparing the total size and screen size to the kindle 5th gen for your reference. Also, I am using the same charging block for this new kindle that I used for my old one.", "title": "Love it so far (8gb)", "location_and_date": "Reviewed in the United States on July 12, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "This thing is great. The battery life is fantastic (I’ve read like 3 books and am not even down to 75% yet), and there are lots of font/size/margin settings that let you set it up the way you like. I’m with the majority here that skipped paying the extra $ for the ad-free version and I agree that it’s the way to go. The ads only show on the Home Screen, mostly are other book recommendations, and aren’t really noticeable, so for me it was worth saving the money and spending it on a nice case instead.", "title": "Great product", "location_and_date": "Reviewed in the United States on July 5, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I had the last version of the Kindle Paperwhite and I loved it. I finally decided it was time for an upgrade when usb-c was becoming the only charger we kept around. So I traded in my old one and bought a new one a few days later. It runs a lot better than my old one since it's newer and it's bigger (enough that I noticed when I got it). I like the new size and it's held up well so far. The battery lasts for weeks and it looks amazing in the sun.", "title": "I love it!", "location_and_date": "Reviewed in the United States on July 17, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I did not get the ad-free display but I keep the tablet face down when not using.I read often throughout the week and took it on a camping weekend with heavy reading and the device never fell below 70% battery. Charges very fast.Feels very lightweight but doesn't feel flimsy.Very portable size.I primarily use Dark Mode and no issues reading anywhere I have been.Has a built in web browser but it is very barebones and not worth using unless desperate (your phone will always be better).", "title": "Good Enough", "location_and_date": "Reviewed in the United States on July 17, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "Finally broke down and got the paper white on prime day.  Have always been a fan of real books vs digital but I have to say am loving my new kindle.  I like that it is so convenient to tote around and especially love that I can read it without my reading glasses! :)Also appreciate that it is water resistant so not worried about reading in the bath, by the pool, etc.Have not explored all its features yet, but so far thumbs up! I may be a digital book convert!", "title": "Love new kindle", "location_and_date": "Reviewed in the United States on July 15, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "Very nice.  There is a bit of a learning curve to access and properly use the various features.  My fumble fingers sometimes cause more than one page to turn (either forward or back).  Once I settled on a font size, light temperature, and brightness, it is a pleasure to read.  With kindle unlimited, I am a kid in the candy shop, picking up books.  I have had the device for a month and recharged the battery twice already, so I guess I am reading more than the average user.", "title": "An improvement over my old Kindle", "location_and_date": "Reviewed in the United States on July 15, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I LOVE my Kindle. It’s so convenient and lightweight. It has so many little features that make reading so much easier. I love that I can read in the dark, don’t have to worry about saving my spot, and don’t have to worry about searching for the book I want because everything is in one place! I also love that you can adjust the font, size, and display. I love that you can hold down a word and instantly see the definition or the context. I love everything about it. Worth every penny!!", "title": "I Love Reading Again!!", "location_and_date": "Reviewed in the United States on July 9, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "It’s a Kindle so it’s not exactly the most complicated piece of technology yet I still can’t find some of the features that I had on previous kindles.I am able to change some of the settings to make the screen look the way that I want it to, but still can’t find some of the other other settings, and don’t even know if they exist. It really shouldn’t be that complicated.Also not to sound like a fuddy duddy, but having a home button is kind of nice and this one does not have one.But if you are an avid Kindle user, what are you supposed to do? They make them how they see fit and sometimes it just doesn’t make sense for every user.", "title": "Hard to find features", "location_and_date": "Reviewed in the United States 🇺🇸 on July 8, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09RD7XM9X", "text": "I love my new Kindle Paperwhite!!  I last charged it on June 7th.  It's now July 7th and my battery is down to 40%.  The trick to a long battery life is turning down the brightness.  There are 24 levels of brightness and I have mine on 8.  If you live in the U.S., I highly recommend downloading the Libby app from the app store for reading library books.  There are plenty of Youtube videos out there if you want to learn more about the Kindle Paperwhite.", "title": "Love the Kindle Paperwhite", "location_and_date": "Reviewed in the United States 🇺🇸 on July 8, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "The Kindle Paperwhite is a great piece of technology for the money. This Kindle is the perfect size and weight. I don't mind the black/white screen at all. The lock screen ads do not interfere with reading either. It is very easy to hold and use. In my opinion, it is lighter than my cell phone which is an iPhone 12 Pro. I prefer to read on this Kindle than to hold the actual book because let's face it, books can be heavy at times. If you are looking to buy a Kindle, I highly recommend this Kindle.", "title": "Perfect size", "location_and_date": "Reviewed in the United States 🇺🇸 on June 29, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "Love it! Had the 2nd generation with key board. Covered in a cool old castle library stick on from decal girl. It finally quit and I have tried desperately to revive it. I eventually bought a new kindle. It was small, cheaply made, very light weigh and hard to hold. Always turning pages by accident. I hated it. Sent it back and finally took a chance on the paper white. I love it. Heavy, in a good way, well made and the perfect size. Love the moss green color-my favorite. 💚 Huge upgrade from the last. I will still like my original the best, but I guess I must move on. Buy it if on the fence. You wont be disappointed. My first book choice? The Book of Enoch. 👑👑👑", "title": "Best one yet. 📚📖📚", "location_and_date": "Reviewed in the United States 🇺🇸 on June 16, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I love the kindle because I can read in bed without disturbing my partner. I love that it has the warm-cool screen option as well as dimming. I also enjoy reading outside because there isn’t a glare with the paper like screen! Plus the water resistant feature makes it much more comfortable for me to read in the tub if I’m just trying to decompress.I have read SO MUCH MORE since buying this product. I 100% recommend it for the money spent, especially with the discounts / free books to read for having Amazon prime.", "title": "Reading so much more!", "location_and_date": "Reviewed in the United States 🇺🇸 on June 27, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "Have had a few kindles over the past couple decades, this one is replacing a 4th gen kindle touch I’ll be giving to my 10 yr old daughter.The backlight is perfect! I had no idea how much I needed this. It’s subtle- not too bright, won’t bother your eyes, won’t keep the person next to you in bed awake; just perfect to read at night in a dark room/read in the daytime in direct sunlight.Highly recommend.I got the cheaper “with ads version”- hasn’t bothered me one bit. Not even noticeable during regular use. I think they must just show on the screensaver when you power down.", "title": "Backlight is a game changer", "location_and_date": "Reviewed in the United States 🇺🇸 on June 23, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I'm so glad my old Kindle Paperwhite got cranky. The new Paperwhite is better by leaps and bounds. The lighting of the screen is more even, the battery life is great, and I'm almost postive that it doesn't weigh as much as my old one. I love being able to adjust the color of the light as well as its level. My only problem with it is that after I finish reading a page I reach for the top right corner of the Kindle and find that there's no paper there!", "title": "Wow! I skipped a generation or so and it's evolved!", "location_and_date": "Reviewed in the United States 🇺🇸 on July 14, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "My previous Kindle was 8 years old and didn't hold a battery charge for a full day.  I have been extremely pleased with the battery life in this model.  I read an hour or two each day and I haven't charged the Kindle for almost 2 weeks!  It's very lightweight and easy to hold.  The dark mode is great for reading in bed.  My eyes do not get tired as there are multiple settings/adjustments which allows the user to set the screen at the brightness and contrast that works best for them.", "title": "Battery life is excellent!", "location_and_date": "Reviewed in the United States 🇺🇸 on June 29, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I had my brand new paperwhit for 16 days. And all of a sudden while reading, it started to fade, (the screen). Then it went to restart I waited. And the Screensaver came on. And within 2 seconds it went white. So I closed, and reopened. Same thing, screen saver, then white. 3 times.  So I figured I would try to plug it in even though I knew it wasn't dead. Then a yellow light turned on. Hmm, call Amazon. And the operator in Asia, or wherever tells me that the warranty  is over. Nope, it's not. Wait time on phone. She comes back and tells me it can be fixed at a repair place, but I have to pay for it. I said No, just return it I said. She said I can't. I told her that wasn't true. So I hung up. She called back twice. I didn't answer. I went back on Amazon and returned it. Went to UPS and and hour later already getting a return. Bought another and it's coming by 5 pm tonight. Don't listen to their lies you have 30 days to return!", "title": "Under warranty but told I would have to pay", "location_and_date": "Reviewed in the United States 🇺🇸 on June 22, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09RD7XM9X", "text": "I am having a problem with the con.  I finished a book, Little Souls by Sandra Dallas and am now reading James Patterson, Triple Cross and several times, and already on Patterson' book I have had 7 different places in the 1st 50 pages that on the space between the 2 lines it says 51 or 41 or 75 highlighters, with is sometimes says that twice and there is usually a very faint underline on several sentences.  I have tried turning it off but did not change.  Can this be changed or will I have to just deal with it.  T know of another reader that just got her new V11 and it does the same thing.  I would like to know if there is something I can do to correct it.  Otherwise I like it.  Funny thing I bought on Thursday June 8, 2023 delivered 5 hours later for $140.00 and Sunday June 11, 2023 was put on sale for $109.00  No refunds!!!  Wish I could have at least gotten a gift card for the difference,", "title": "Have Amazon Prime and Kindle was delivered within 5 hours of ordering.", "location_and_date": "Reviewed in the United States 🇺🇸 on June 13, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I received my Kindle yesterday. It is the first one I've ever had or even used. The text looks good on it and I am getting accustomed to how to use it. I attempted to sign up for the free 3-month trial of Kindle Unlimited, but it is not appearing and my Amazon account says I do not have it and offers me a free 1-month trial. I'd rather have the 3-month one! I cannot seem to find any way to get help with this and hope someone from Amazon will reply here.My only other complaint is that it seems difficult to get the Kindle to recognize my touching the 'buttons'--or perhaps it just takes it a long time to change things?", "title": "3-month Kindle Unlimited subscription does not work??", "location_and_date": "Reviewed in the United States 🇺🇸 on July 14, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09RD7XM9X", "text": "I had the original Kindle and the Kindle Fire and this one blows them out of the water. I love that there is no glare and the sunlight does not affect my reading. I also am a big nighttime reader or reading in the car at night so the adjustable back light is perfect for that. A feature I also love is the warmth feature so I can turn it down in the evening so the blue light does not affect my circadian rhythm as much.", "title": "The best Kindle I’ve owned", "location_and_date": "Reviewed in the United States 🇺🇸 on July 17, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "Came the same day I ordered it. I turned on and it found my Wi-Fi and said hello Albert let’s get started and I was shocked. I still haven’t been able to figure out how to make the screen brighter but I’ll get it just give me time. I have Kindle unlimited I wish there was a way I could fine out many books  I’ve read it must be over 500 but because you to return them can’t count them oh still love to read.", "title": "That was fast", "location_and_date": "Reviewed in the United States 🇺🇸 on July 17, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I bought this for my sister's birthday in May and I legit don't think she has put it down. We are huge readers and we love the physical book holding BUT I don't think she is in that gear anymore LOL. She LOVES reading on her Kindle and I think this GB amount is the perfect storage. I would buy this item for myself, if I liked reading online but I don't, and I would buy it for anyone I knew wanted a kindle. GREAT buy.", "title": "GREAT item to buy yourself or as a gift", "location_and_date": "Reviewed in the United States 🇺🇸 on July 12, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "The only problem I've had with this kindle is that when I carry it in my pants pocket, the screen will sometimes activate. I think the touch screen might be pressing up against my phone, or my leg through the fabric of what I'm wearing, but it has lead to sometimes moving a few pages in one direction or the other, or accidentally resizing the font some. I might also be hitting the power button by accident while retrieving my phone.I don't really consider that a major problem though. Since it arrived I've already completed reading 4 books on it and it hasn't felt like the screen has caused additional eye strain or fatigue. As compared to, say, reading what I'm typing right now against the blindingly white background of the amazon website on my computer's monitor. The touch screen is responsive, the battery life is great (I've gone for weeks between charging it while reading for hours a day without running the power out), and the storage space on it is more than sufficient for what I need it for. And because I've been reading so much on it, the kindle unlimited subscription is cheaper than buying the books in physical format and I don't have to find places to store them after reading them. The only downside is that I can't take said kindleunlimited copies and just give them to friends as recommended reads like I can with the physical copies, but this is a technology that has been around for a while and the refinement inherent in this product shows.I'm happy with it.", "title": "Glad I waited until this generation of product", "location_and_date": "Reviewed in the United States 🇺🇸 on May 16, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "So far this product has met my expectations. Being able to adjust the lighting to an amber color helps when reading at night and it actually reminds me of reading an actual book. It is lightweight, easy to carry with you wherever you go. I appreciate that this screen is bigger. I would like to also mention the fact that is quicker than my old one. It seems to be smoother from page to page. The clarity is there, which is always a plus. I haven't experienced the battery draining yet, so I am not sure how long it will actually last. I will say this though, I got this product on Tuesday and it is at 87%. If it were my old kindle I would be at about 10%. So there is a definite plus I am seeing. I bought the agave green and I am digging the color. I am happy there was options. I have not tested the waterproofing just yet. I really am hoping I will never have to. So far this product has met my expectations and I am not disappointed.", "title": "Quick", "location_and_date": "Reviewed in the United States 🇺🇸 on June 9, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "This might be one of the best purchases I've made, I finish 600 page books in a few days (this is coming from someone who takes a month to finish a paperback book). It's also lightweight and slim so you can carry with you. One thing I love is that the screen on the lowest brightness looks/feels like paper instead of electronic screen but you can also adjust the brightness and warmness of the screen if you want to read in the dark.", "title": "I'm obsessed", "location_and_date": "Reviewed in the United States 🇺🇸 on July 22, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "So I never thought I would ever get a kindle…..but yet here I am reading a lot faster and truly enjoying it! I love how when I’m reading it it’s actually like I’m reading paper. Been having a ball reading it outside by the pool. Absolutely no glare and I don’t have to worry about it getting wet like I would a paperback. Oh and the battery! Wow I love how the battery lasts like 2 weeks without even having to charge it. Definitely worth every penny!", "title": "Still in shock…..", "location_and_date": "Reviewed in the United States 🇺🇸 on July 9, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "Bought this for Mother’s Day for wife. She was into physical books and hated the idea of reading from her phone.Enter this Kindle - it took over the entire bookshelf hierarchy in conjunction with a Kindle Unlimited subscription. Also note that Amazon allow for direct download of books, unlike using Kindle app on iPhone.The paperwhite nature of this is terrific, though the UI is very Amazon-ish.Battery life coming from a phone is like a MacBook Air coming from Lenovo’s latest iteration. Overall great reader.", "title": "Wife = e-reader convert!", "location_and_date": "Reviewed in the United States 🇺🇸 on July 4, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "Absolutely love using my kindle Paperwhite! I love that it’s light weight, batter lasts FOREVER, and there is no glare from lights on the screen. I can read for much longer at a time while using the kindle as compared to reading on my phone. I prefer my kindle to physical books because I have a wrist injury that’s healing from surgery which makes holding open a physical book difficult. My kindle can be used very easily one handed to hold, flip pages, and even swap between books if I’d like too.", "title": "Such a good way to read!", "location_and_date": "Reviewed in the United States 🇺🇸 on June 24, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I like that you can roam and easily come back to the page you were on, I like using dark mode at night to read myself to sleep, and I like using the warm setting to counteract blue light. However, I paid $20 plus tax to eliminate advertisements, and I don't like the fact that there are still ads on my home page. Fortunately other Kindle users online clued me in to using Library rather than Home for most things. Of course, you still have to go Home to get a book and put it in your Library, but it does keep you from having to see all that clutter on a daily basis.", "title": "An Improvement over Earlier Kindle Versions", "location_and_date": "Reviewed in the United States 🇺🇸 on July 11, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09RD7XM9X", "text": "I had my kindle for a week and at first I was skeptical on how much I would like to read on it, I ended up loving it and reading 2 and a half books on the short time I had it. However, today when I tried to turn it on (9 days after purchasing) it was stuck on the “waking up” page. I’m glad that Amazon support was helpful and allowed me to send it back and get a replacement, however I’m sad that it had such a short live time with me. I’m hopeful that the replacement will not have this issue once I receive it and get to use it more.", "title": "Loved it! But was unresponsive after a week of purchasing", "location_and_date": "Reviewed in the United States 🇺🇸 on July 20, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09RD7XM9X", "text": "I was on the fence for so long about purchasing an E reader, because I just love the feel of a book in my hands. However, I was spending a lot of money on books and finding it hard to store the books once I finish reading them. I decided to take the plunge and buy a Kindle Paperwhite as well as a Kindle Unlimited subscription and I’m so glad I did! I am reading more books than ever and the Kindle is so lightweight and fits nicely in my purse. I take it everywhere so that I’m never bored if I have to wait on someone or some thing.", "title": "I finally see what all the hype is about!", "location_and_date": "Reviewed in the United States 🇺🇸 on July 10, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I definitely thought I was a physical book girlie but after buying this kindle I will no longer look back! You get 3 free months of kindle unlimited which is a great bonus! I’ve been reading so much faster any time and anywhere since having the kindle! I would definitely recommend others to try kindle reading if they’re on the fence about it! In bright sunlight there is NO GLARE what so ever and it reads imo even better than paper!", "title": "LOVE MY KINDLE", "location_and_date": "Reviewed in the United States 🇺🇸 on July 2, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "Upgraded from a 6-7 year old Kindle. I like the smooth face on this one. It has a nice backlight with an adjustable amber effect. There is a dark mode which makes the background black and the text white. I like the dark mode for nighttime reading. I like the weight and feel of this model. My library (about 50 books) hasn’t made a dent in the storage space so I would say the 8GB is fine unless you have audio books or something that might take up more space. The advertising on the lock screen isn’t as annoying as the adds that would pop up on my previous Kindle. The adds on this one appear somewhat related to stuff that I might actually be interested in reading.", "title": "Very pleased", "location_and_date": "Reviewed in the United States 🇺🇸 on June 13, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "So one wonderful thing about this Amazon Kindle is the battery life. The battery life last forever or so it seems. The one tricky thing about purchasing an Amazon Kindle is that the prices fluctuate very frequently. Sometimes you can get a Kindle for $99, but sometimes the price is copped $139. So the negative part about the kennel is the fact that the price fluctuates but other than that there is not a single con with this purchase. Fast fact, sometimes they make you pay more money to have the ads removed. I made it a point to tell them that I share this candle with my younger cousins and my mom  and there was a lot of ads for books of an erotic nature, and if you tell them that you share your Kindle with family they remove the ads for free.Another negative to this review is the fact that Amazon kindle’s prices have gone up.", "title": "Amazing purchase for avid readers", "location_and_date": "Reviewed in the United States 🇺🇸 on June 10, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I reluctantly purchased this for my partner fearing he'd give up on learning a new device. Bah! I was so wrong, he loves it. He's getting most of his materials from the library, but is happy to find free, or inexpensive books on Kindle Prime. He's also a fan of all the Sci Fi available. We accessorized it with the cork cover which seems to be holding up well so far. It's a winner!", "title": "Vacation reading!", "location_and_date": "Reviewed in the United States 🇺🇸 on July 10, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "This is my 8th Kindle.  I still have the 10th edition.  But I decided to purchase this 11th generation.  I was a little bit caught between getting another fire tablet (I currently own five).  With my new Kindle, everything loads fast.  The reading size of 6.8\" is perfect for me.  I like that the screen does not have a raised edge around it.  Page turning is much more responsive.  I expected the new warm light feature to be orange.  The yellow is nice in that it goes from a very soft color to a bright yellow.  The capacity went from 4mb to 8.  I downloaded 100 books and they took up hardly any memory.  I finished a book while waiting for an appointment.  Then I remembered that you cannot access downloaded books unless you have wifi on.  I was so surprised that this Kindle let me open a downloaded file without wifi.  I am very happy with this product.", "title": "It has all the features I have wished for in a kindle", "location_and_date": "Reviewed in the United States 🇺🇸 on May 29, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I had a kindle fire for years and the battery started to not be so great for me. So I replaced it with this and omg, I’m in love. There’s no bells and whistles but I only used my fire to read anyway. It was delivered to me on may 6th and I charged it to full and DID NOT HAVE RO CHARGE IT UNTIL LAST NIGHT 6/7. It was still at 29% but just figured I would. I use it every single day minus maybe a day or two I didn’t have time and I’d say atleast an hour or more a day. For that alone, this was beyond worth it for me and I’m totally happy with it. It’s not slow or laggy either like my fire got after a while. Totally recommend as an easy peasy e reader!!", "title": "In love with this!", "location_and_date": "Reviewed in the United States 🇺🇸 on June 9, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "The color of kindle and the cover are denim blue which is fantastic but what I love most is the wider screen. I have trouble with my eyes so the wider screen allows me a wider range of visibility and with the addition of new lighting features I have easier control of the brightness or dimness of what I am look at and  I do not have to increase the font in order to read the content or use the tool bar.  I appreciated and loved all my previous kindles but this newest generation helps make reading from me more enjoyable than before with more storage for even more books to love. I highly recommend this latest Kindle.", "title": "Love, Love, Love!", "location_and_date": "Reviewed in the United States 🇺🇸 on June 14, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "He got me an Oasis a few years back for Christmas. I wanted something with a warm backlight and at the time the paper white only came in the bright white light. I am jealous that the new paper white is better than my only two year old, $230 kindle. The paper white has a USB-C a huge upgrade from the Oasis’ micro USB. It also has the warm backlight.It seems like a huge upgrade to still be half the price of the Oasis. I’m happy for my husband, but mad my “fancier” kindle is actually not even as good as his after only two years.", "title": "I got this for my husband and I’m jealous", "location_and_date": "Reviewed in the United States on June 11, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "My husband bought it as a surprise for me on our wedding anniversary and it is the best gift I have ever received.  The size of the screen is perfect and adjustable text size makes reading easy and enjoyable.  Dark mode helps keep headaches at bay and the yellow tinting makes it look like a real book. E ink screen actually feels like paper when you run your finge5s over it. I hope the next uprade will have a find my device option that can be used from a phone,  but other than that couldn't be happier with this device.", "title": "Just amazing.", "location_and_date": "Reviewed in the United States on June 19, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I love the paperwhite - this is my 4th! I do have a complaint though - I would recommend a design change that puts the charging port and the power button on the top or side of the unit. When you're holding the kindle, your fingers may be on the side of the unit, but your thumb is on the bottom and it is easy to hit the power button on the bottom of the unit. I have done this multiple times. Also, it is very sensitive to taps or swipes for page turning. I often - much more often than previous versions -  turn a couple pages or even more.", "title": "ExCellent Product", "location_and_date": "Reviewed in the United States on June 14, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "This is a great buy! I'm impressed with being able to read outside in the sun; something you can't do on a tablet or phone! Battery holds a long charge. It's small and compact so it'll easily fit in a medium sized purse. It's super light weight. I haven't tested It's waterproof/splashproof rating.  It says it can handle it, so I'll take their word on that. The only con I have is large print isn't very large. My pic shows the large print. For most people this is perfect, but I could use a slightly larger font so I don't have to wear reading glasses. Other than that, I highly recommend this device, and I'm planning on getting one for a friend.", "title": "Sunlight reading is awesome!", "location_and_date": "Reviewed in the United States on June 13, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "It's great EXCEPT they put the power button on the bottom.  So stupid I accidentally hit it frequently just from holding or adjusting my hold on the damn thing.  I still plan on keeping it.  I like the larger reading area.  I traded in a Voyage Kindle which had the auto brightness which is another feature this one doesn't have but the warm light feature it does have is good.  One pretty obvious design f-up with the power button but it's pretty good.  Definitely get it on sale.  I would not pay over $100 for it.", "title": "Good but power button placement FAIL", "location_and_date": "Reviewed in the United States on July 14, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09RD7XM9X", "text": "I  bought this small Kindle because I enjoy ebooks  and my mini iPad is heavier to carry and quickly loses its battery charge.  The  Kindle Paperwhite is very easy to set up, downloads library books easily,  and has adjustable lighting to create the best reading experience.  The battery stays charged for a very long  time. This Kindle is an excellent product.", "title": "Easy to load, easy to read, light to carry...", "location_and_date": "Reviewed in the United States on July 23, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "Was reluctant to purchase one as I really love the feel of paper books but my partner got it because No more bookshelf space. I am never going back ! Battery life is amazing. The selections of books to get are perfect especially for ladies like me who love more sultry stories. I love finding the smaller publishers work which is in abundance. Would definitely recommend having one.", "title": "Never looking back", "location_and_date": "Reviewed in the United States on July 8, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "Bought my first Kindle in 2010, upgraded to the Kindle Paperwhite in 2015, and just ordered the newer 6.8” Kindle Paperwhite. I already miss my 2015 version. While reading on any Kindle is my preferred way of reading and transporting books, there are three grievances I have.#1 My previous Kindle opened up to the page I left off on. My new Kindle opens up to an ad for a book while it “wakes up.”  It then requires you to swipe to get to your reading material. I really don’t like seeing an ad. I have purchased over 300 Kindle books. I get recommendation emails nearly daily. I know how and where to find reading material. When I’m ready to read, I want to read, not look at an ad.#2 The power adapter for my new Kindle is not the mini USB. It is also not an Apple-compatible connector. All the mini USB cords I have purchased for my previous Kindle are useless. Device creators should be moving toward universal adapters, not creating new sizes and shapes. This is very frustrating and wasteful.#3 I always left the time on the top of my screen on my previous Kindle. When I’m reading, I like to glance up to check the time. On my new Kindle, I have to open a drop down menu to see the time. This is much more of a distraction.So deal breakers, no, but I feel the Kindle is regressing in reader convenience.", "title": "Stop changing a great product", "location_and_date": "Reviewed in the United States on May 11, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09RD7XM9X", "text": "This is an upgrade to my previous Paperwhite who had a faulty screen (freezing).- Bigger screen is great for reading PDFs (not converted).- Warm light is a nice plus.- Text is sharp but not noticeable better compared to the ~212ppi of the previous Kindle models.- Page turns are fast (unless there are images).- People complained about the weight but it's light, even holding in while you're laying down in bed.What I dislike:- plush-screen. The previous design is better since you can hold the border and know when you're touching the screen. It also gives more protection since any pressure will not concentrate on borders (like when you put in your backpack.- Software. We all know Amazon will try to gather as much data as possible about you and now you can't use the Kindle without registering. You can sideload ebooks without registering but now every time you go back to your library, a pop-up saying you need to register or connect to the internet to access \"The Cloud\". So the workaround is registering the device, put in airplane mode and sideload your ebooks.I paid $130 with taxes for the device. Hopefully it'll last years and the device is great.", "title": "Really good", "location_and_date": "Reviewed in the United States on May 20, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09RD7XM9X", "text": "I have become dependent on my kindle.  I am a voracious reader and cannot stand being without a book. This is the third kindle I have purchased in about 15 years. The batteries eventually just won't hold a charge worth a darn. I am going on a trip next monnth and needed a kindle that didn't need to be charged twice a day.. too inconvenient with traveling. Am very happy with this one. If you have the money to get a kindle with cell dowload ability, that can be convenient.  However, most places have some internet and you can download several books ahead of time if you think that might be a problem.", "title": "Good Kindle", "location_and_date": "Reviewed in the United States on June 17, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I had originally wanted the Oasis, but after seeing how small it was in my local Amazon store I decided against it. Now comes this one with the larger display, and I finally bought my beloved Kindle. I’m an avid reader, and the KU subscription has definitely been worth it. I wish I would’ve known that if you did the 2 months free that you’d never be able to buy a year subscription (way more cost effective), but honestly, whatever. I read a book just about every day, so the $10 a month is much cheaper than buying physical books.", "title": "Best purchase in a LONG time!", "location_and_date": "Reviewed in the United States on June 18, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I didn’t think I would like having a kindle over a book this much! It’s so comfortable to read on. From sitting at the table, couch, in bed laying how ever I want. Not having to hold the book in awkward ways to be more comfortable. It’s literally perfect!I just like the physical book bc I love to see my progress on a book shelf.", "title": "Im Obsessed!", "location_and_date": "Reviewed in the United States on July 19, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I got the denim 16g one and it’s perfect. I can’t notice the difference between that and my basic 2019 kindle. The screen is bigger but holding it is Fine. It has a night mode where the screen turns orange, and it has a dark and light mode. The only complaint I have is how smudgy the screen gets with fingerprints. Decorated case for inspo", "title": "Love it !", "location_and_date": "Reviewed in the United States on July 19, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "This device feels very comfortable in my hands. I love the weight of this device... it does not stress out my wrists like reading a heavier book would. I like the idea that I can have a huge library on one small device and not have to carry around a lot of heavy books. I have the 16GB Paperwhite by the way with ads. The ads are not bad at all... it looks like its recommending to me the books I would be interested in based on my reading habits. I mostly read sci-fi/fantasy fiction. I was surprised how well I could read this device in my dark living room. Also I can listen to my audio books, I just have to attach a blue tooth device to receive audio. Also since this reader is strictly just for reading I find myself more committed to reading my books and not getting distracted by other things, like if I were to try to read on my tablet or my phone. This is easily one of the best investments I have made for 2023. I would definitely recommend getting a cover for this device to protect it from screen damages, etc. This device charges with a USB C which is nice for me because I have lots of USB C devices in the house so this kindle can share the same cables to charge. It charges quickly. I can't speak for the length of time this holds a charge because I just received this kindle.", "title": "Easy to use", "location_and_date": "Reviewed in the United States on May 9, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I hesitated on getting a kindle because I love a real book. But I fell in love as soon as my kindle arrived! There were so many features I didn’t even realize and how helpful they are! The ability to have a dictionary at your fingertips to look words up as you read and the X-ray function is amazing to help you with remembering characters and info within the book! 💜", "title": "Don’t think just buy!", "location_and_date": "Reviewed in the United States on July 4, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I've been reading books at night, since I was 6. Husband has never gone to sleep without the light being on.I love the feel of a real book in my hand.  I thought I would give this a go.  Glad I did.  The charge last forever and if the backup light is too bright you can turn it down.  I have a bad habit of falling asleep with it in my hand, so I bought a case and that's working great.  Yes, I've dropped it a few times and no harm.", "title": "Nothing like I thought it would be.", "location_and_date": "Reviewed in the United States on June 22, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I got this last year as an upgrade to my Kindle Paperwhite 3.  After having used it for a year, I think I have settled on most of my opinions.  So, here's the breakdown:Pros:++ The screen is larger+ The resolution is sharper++ The warm light option is excellent, and one of its biggest selling points+ The internal software for calculating my reading speed is more accurate and more reliable.  It often glitched out on my Paperwhite 3 and got stuck believing that I read at god-level speeds.  Nothing like this has ever happened on my Paperwhite 5, although it still seems to generally underestimate how long it'll take me to finish a chapter.+ USB-C connection rather than micro-USB: this makes for delghtfully fast charging.+ It can store audiobooks and has bluetooth capabilities.  However, I have yet to take an interest in either of these functions.Cons:- It's actually a little bit LESS responsive than my Paperwhite 3.- The bezel is flush with the screen, which I suppose makes it waterproof, but it also makes the device harder to grip.- The bezel is too narrow for my tastes, since it again makes the device harder to grip without touching the screen.  Though, this issue can be mitigated by increasing the margin size.  The Kindle doesn't do anything with touch inputs that are sufficiently long and don't touch any words, so you can safely rest your thumb on the margins while you're reading.-- It takes significantly longer to wake up than my Paperwhite 3.  Part of that is because my Paperwhite 5 has ads on the lock screen, meaning I have to always swipe to unlock, which I don't have to do with my Paperwhite 3.  But even with this under consideration, when it's my first time turning the device on after a while, it usually takes around 1-3 seconds to prompt me to swipe to unlock, and another 1-2 seconds for it to actually load up my reading spot again.  It's especially bad when the Kindle is cool, e.g. under 60 degrees.  But my Paperwhite 3 was also a lot slower in cold air too, so this isn't too big of a gripe.-- I'm pretty sure the screen bleeding is worse in this model than for the Paperwhite 3.  Stray artifacts will sometimes stick around even after the screen refreshes, leaving traces of the previous screen state lingering on the device.  I've attached a photo to show you what I'm talking about.  In it, my Kindle is set to sleep mode, but you can see the words in the current book that I'm reading.  The Paperwhite 3 does this a bit too, but nowhere near as badly, and the screen refreshes are always successful.  This is a somewhat minor inconvenience, but it is a distraction sometimes.Overall, I'm not entirely sure if I can even call this an upgrade to the Paperwhite 3.  It has a lot of extra features that I love, and I guess at the end of the day, it's this model that I'm reading now and not my old Paperwhite 3.  But when I look back at my old Paperwhite 3, and consider the fact that it still works perfectly fine, I can't help but feel like I really didn't need this upgrade.So, if you're looking to pick up a new Kindle Paperwhite ... yeah, get the NEW Kindle Paperwhite.  The USB C charger, the larger screen, and the warm light are all major conveniences that make using the device a lot more enjoyable.  But if you are in the position I was in back in 2022, and you want to upgrade the Paperwhite that you already have, then save yourself the money and skip this.  You're not getting that much more, and you'll probably be trading off some features that you like in the process.", "title": "There are some things I really like about it, and also some things I really dislike about it", "location_and_date": "Reviewed in the United States on March 24, 2023", "verified": true, "rating": "3.0"},
{"asin": "B09RD7XM9X", "text": "I love love love it. You can read anywhere in any light. I can even read in the hot tub. I imagine if you had a pool, you could float in the pool and read in the bright sunligt. I know you can read in low light situations also. I have not found it to cause any eye strain no matter the lighting and I read for hours at a time.", "title": "Easy to read anywhere", "location_and_date": "Reviewed in the United States on July 12, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "So I came into possession of this little guy due to a late night Amazon impulse buy a few days before leaving for vacation. I was going on a weeklong  trip with my family and didn't want to have to bring my ipad (what I usually use to read) or any actual books with me on the plane. Let me preface this by saying I am an avid reader, spending the majority of my free time reading...and have been for most of my life. My siblings lament to anyone listening about the horror of summer road trips, riding in the back of our family sedan, fighting for leg room because I always had at least 5-6 books at my feet to read during our travels. You should hear the way my sister grumbles at even the mere mention of a car ride with me (She horribly dramatic) but I digress. I also used to have a nook e-reader, an original model Kindle from way back in the day that no longer works, and have the kindle app on my ipad which I use to read most days. So I am familiar with e-reading. This kindle is quite possibly the best purchase I've ever made. It's basically pocket sized so it was extremely portable. I brought it with me everywhere; On the plane, in the car, in my bag to restaurants...I even managed to fit it in a particularly spacious pocket of an oversized jean jacket I wore on cooler nights. It's amazing. It was comfortable enough to hold in one hand, or two, depending on what I preferred at the time. The various light options on the kindle, including the warm light feature makes it easy to read regardless of where I was and what kind of lighting is available, without eye strain. I shared a room with family for a couple of nights and the dark mode feature barely emits light past my immediate person, so I was able to read into the wee hours of the morning if I wanted to without disturbing my family sleeping in the same room, or sacrificing my precious reading time. ( I get particularly sassy if I'm interrupted in the middle of a discovering a plot twist in a juicy novel, i'm just saying). You are able to customize lots of the settings, such as the fonts, size, spacing and layout, so that the books look however you want them to while reading. (I definitely used that feature to make the font smaller and more compact while I read an embarrassingly cringleworthy, but suprisingly emotional and fantastic, harlequin romance novel while on the plane. It's nobody's business why I was practically sobbing into my complimentary pretzels after the protagonists romantic interest declared his love to her for the first time, thank you very much) I also may, or may not have had a TINY accident in which I spilled my entire 32oz water bottle full of water all over my pants and my kindle. After squealing in alarm at how cold the water was, I was able to get my bearings, wiped the water off the kindle, changed my pants and continued reading. I have noted no damage whatsoever to my kindle and that was at the beginning of my trip well over a week ago now. After reading every day for at least 4-6 hours per day/night for 7 days straight I had 57% battery left over. I think the battery is supposed to last for 2 weeks maybe? IDK. Basically it lasted a long time, long enough for me to be impressed. Also, I downloaded at least 15 new books on there, not to mention the impressive collection of books I already owned and was able to sync to the device, and I still have over 4GB of space available to use. I have since named the kindle Kurt, as I feel emotionally connected to the device after our adventures together these past weeks. If you are a super bookworm like me, or are just trying to finish a whole book for the first time, I highly recommend this device for purchase. I think it was worth the money a thousand times over. And if after reading this you do decide to purchase it, I hope you love it just as much as I do.", "title": "Perfect for travel...and the rest of your days", "location_and_date": "Reviewed in the United States on September 16, 2022", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "So, this has actually really helped with my eye strain and screen triggered migraines. I just wish the Home Screen had the same options as the app on my iPhone—I’d like to read my cheesy Vella weekly updates and I’d like to be able to remove stuff from the carousel. I do like that my series are grouped.I do want more than good reads recs or the “this is just like what you just read” algorithm.That said, I highly recommend the paper white as an affordable e-reader for outdoors and eye strain.", "title": "No blue light. Great personalization", "location_and_date": "Reviewed in the United States on July 10, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09RD7XM9X", "text": "I am an avid reader on kindle. I read every day and almost solely read on my kindle. I have been using a paperwhite since 2018. I loved it. I was under I’d this upgrade was worth buying a new kindle. I was intrigued by the larger screen and the option for warm light. I was wary of purchasing because from what it looked like online, the kindles were almost the same size.Though the new kindle itself is only a few cm wider/taller than the last version, the screen itself is wayyyy larger. It’s a huge difference for the reading experience. I am loving the larger screen. I also like warm mode. I keep it on halfway warm mode all the time. You can set a schedule and have your kindle get warmer with the sunset and rise which is pretty cool. I’m super picky so I like to set my own brightness and warmth all the time. In the photo you can see the significant size difference. The new larger size has a negligible effect on the weight. I put a pop socket on all my kindles and with the pop sockets on, I almost can’t tell a difference between the two. If you are a very avid reader and want the larger screen, I say go for it. I bought on prime day and was able to get ad free for only $109. My old kindle started to give out on the battery side of things. When I first got it, it stayed charged for weeks! I read a few hours every day and it would remain charged for a long time. At the end it would only last me about 2-3 days or 12 hours of read time. The new paperwhite (from what I can tell) keeps a charge for a very long time. I’ve put about 8 hours of read time on her so far and she still has 84% battery. The new charger is USBC which is worth noting.Side note: it’s so dumb that you have to pay for an ad free kindle. The old one never had that option, I think it sucks.", "title": "The screen is significantly larger than the last paperwhite", "location_and_date": "Reviewed in the United States on July 23, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I loved my old Kindle I had. I love this one even more. Easier to read...", "title": "Love it", "location_and_date": "Reviewed in the United States on July 23, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "This is my third Kindle and is replacing my 2015 one that was starting to slow down. I love that you no longer have to swipe to open it each time. Also, have seen many comments from people who buy a Kindle and complain you don't get a cable - People, the cable is buried in the bottom of the box! You kind of have to dig it out! I love that there is no 'frame' per se, also which I hadn't realized till I got it.", "title": "So wonderful!", "location_and_date": "Reviewed in the United States on July 23, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I  bought this small Kindle because I enjoy ebooks  and my mini iPad is heavier to carry and quickly loses its battery charge.  The  Kindle Paperwhite is very easy to set up, downloads library books easily,  and has adjustable lighting to create the best reading experience.  The battery stays charged for a very long  time. This Kindle is an excellent product.", "title": "Easy to load, easy to read, light to carry...", "location_and_date": "Reviewed in the United States on July 23, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I love my Kindle Paperwhite.  I’m really impressed with the battery, it lasts forever.", "title": "Excellent reader", "location_and_date": "Reviewed in the United States on July 23, 2023", "verified": false, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I haven't had a Kindle in many years. The only thing that truly stood out to me and I didn't care for was that the Kindle does not have color. I would've thought with how far along technology is that the screen would look more vibrant and alive, not grayscale.", "title": "Great for Reading on the Go", "location_and_date": "Reviewed in the United States on July 23, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09RD7XM9X", "text": "I’ve been struggling to read physical books and audiobooks/ebooks all my life. The last time I finished a whole book was back in 2015 and that’s because it was a school assignment.. embarrassing but true. I got this kindle a few days ago and I’ve finished a whole book and halfway through another!! I love it!", "title": "Amazing", "location_and_date": "Reviewed in the United States on July 23, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "Quick easy set up - device was already linked to my account. Awesome battery life. Can’t go anywhere without now. Absolutely love it!", "title": "An absolute must have for readers", "location_and_date": "Reviewed in the United States on July 23, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "This is absolutely amazing. It is so much faster than my older one. As always it has an amazing display and feels good in the hand. Very well made product. And fuels my love for reading!", "title": "GREAT!", "location_and_date": "Reviewed in the United States on July 23, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n     Love it. It doesn’t hurt my eyes as much as reading on my phone. Love the selection of books. I just wish the screen was a little more smooth when scrolling. Typing is a nightmare on it lol it’s so laggy. 9/10", "title": "where has this been my whole life", "location_and_date": "Reviewed in the United States on July 23, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09RD7XM9X", "text": "I love my kindle so much! I've read so so many books thanks to it! Its so cute. I take mine everywhere! I think everyone should get one.BB", "title": "The best purchase of my life!!", "location_and_date": "Reviewed in the United States 🇺🇸 on July 22, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I don't like the smaller edges. And I don't like the way the page is flipped when I'm reading and not wanting the pages to flip.", "title": "Smaller edges", "location_and_date": "Reviewed in the United States 🇺🇸 on July 22, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09RD7XM9X", "text": "Portable,convenient, great when running out of spare to put books", "title": "Convenient", "location_and_date": "Reviewed in the United States 🇺🇸 on July 22, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "This might be one of the best purchases I've made, I finish 600 page books in a few days (this is coming from someone who takes a month to finish a paperback book). It's also lightweight and slim so you can carry with you. One thing I love is that the screen on the lowest brightness looks/feels like paper instead of electronic screen but you can also adjust the brightness and warmness of the screen if you want to read in the dark.", "title": "I'm obsessed", "location_and_date": "Reviewed in the United States 🇺🇸 on July 22, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "With the expanded page size, the frame area is too narrow to hold comfortably without triggering unwanted page turns and drop down menus. Also the paging is STILL unreliable and jumps forward 5-10 pages about 10 % of the time. This is my fourth kindle and the one I’m least satisfied with!", "title": "Worst kindle paper white yet", "location_and_date": "Reviewed in the United States 🇺🇸 on July 22, 2023", "verified": true, "rating": "1.0"},
{"asin": "B09RD7XM9X", "text": "I had one years ago in color with great screen quality and easy to us. This one's screen clarity not good.  Very hard to maneuver. Very unhappy with purchase.", "title": "Not good quality.", "location_and_date": "Reviewed in the United States 🇺🇸 on July 22, 2023", "verified": true, "rating": "1.0"},
{"asin": "B09RD7XM9X", "text": "This is the 2nd one I ordered to replace the 1st one and they both had a dead pixel. I picked the one that was the least annoying… seems like a QC issue but overall the product works well", "title": "Nice but…", "location_and_date": "Reviewed in the United States 🇺🇸 on July 21, 2023", "verified": true, "rating": "3.0"},
{"asin": "B09RD7XM9X", "text": "I got each of my two kids one of these.  Ages 13 and 17.They had permission to read at night, but had to have a light on.  They have remote controlled lights.  and the rooms are side by side.  So when activated, it turns both on or off.  So, if boy's is off, and girl turns hers off, then the boy's turns on.  And if they are both on, then both go off.  Annoying.They both had a kindle and loved them.The one thing is that these now are so attached to the Amazon store, that it is often difficult to know whether a book is already purchased or if you accidentally just bought a book.  So Frustrating.But once into our own sizable library, they love the reading and the light.", "title": "Kids Love It", "location_and_date": "Reviewed in the United States 🇺🇸 on July 21, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09RD7XM9X", "text": "I love it. Can take her anywhere and so far she hasn’t over heated like my iPad does out in the sun! The green is so beautiful. Glad I paid extra for that!", "title": "LOVE IT", "location_and_date": "Reviewed in the United States 🇺🇸 on July 21, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I finally treated myself this  year to a Kindle.  My girlfriends love their kindles and I thought I like holding a real book, which I still do, but I am traveling a lot this year and needed a couple of books and don't want to lug around.  This kindle is light, the battery is crazy strong.  I can go a week without using and the battery still holds a charge.  I have had it 3 months and the light on it is perfect and can be adjusted.  The touch screen is very reactive and I love that I can look up vocabulary and history background on the books I have read.  Holding it is easier than an ipad also.  Ipad weighs more and the light is not good for reading outside.  Took it to the Bahamas and was outside in the bright sunshine and no problem reading.  It is just like reading a paper page.  Lots of settings that allow you to customize it to your needs.", "title": "Thought I could read books on my Ipad...but the Kindle is Much Better!", "location_and_date": "Reviewed in the United States 🇺🇸 on July 21, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "can't live without my kindle!", "title": "love it!", "location_and_date": "Reviewed in the United States 🇺🇸 on July 21, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "This is my first Kindle and I absolutely love it! I used to love paperbacks but the ease of this product has switched me to Kindle only. I was worried it may be too big but it is a perfect size for my hands and easy to hold/grasp. The battery life last so long, I read all day and haven’t had to charge it in days. It’s easy to work and has great lighting features. It really does look like you’re reading a book. It has great customization options too for the text you’re reading. You can even add a passcode if necessary and you can set the cover of the current book you’re reading as the background of the kindle which makes the kindle look even more like a paperback. I recommend this to anyone who likes to read or wants to get into reading, it’s addicting! I’ve been reading daily since this was delivered.", "title": "Perfect for readers", "location_and_date": "Reviewed in the United States 🇺🇸 on July 21, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "So lightweight and easy to use. I get my books from the library and they send over flawlessly. Easy to read on. Battery life is insane and lasts forever. Such a good buy.", "title": "Just as good as a book", "location_and_date": "Reviewed in the United States 🇺🇸 on July 21, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "Good size, love it", "title": "Kindle", "location_and_date": "Reviewed in the United States 🇺🇸 on July 21, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "Lo compre recientemente para mi hija, ya que yo aun conservo el mio comprado en el 2016, y la verdad que me gusta mucho.Se agradece el mayor tamaño de la pantalla asi como la mejora en la iluminacion.En mi caso, que soy lector asiduo puedo asegurar que funciona muy bien y soporta perfectamente el paso de los años. Este dispositivo es siempre una gran compra.", "title": "Exelente dispositivo.", "location_and_date": "Reviewed in the United States 🇺🇸 on July 21, 2023", "verified": false, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "Es mi segundo Kindle despues de muchos años. El primero sigue funcionando  perfectamente pero ya era hora de actualizarlo. Contento con el nuevo.", "title": "Satisfecho", "location_and_date": "Reviewed in the United States 🇺🇸 on July 21, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "Absolutely love it! I use it every day all the time. Easy to use great value.", "title": "Love it", "location_and_date": "Reviewed in the United States 🇺🇸 on July 21, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "This Kindle is light and beautiful and waterproof and with plenty of storage. For some reason the user interface has all kinds of weird small bugs and I'm not impressed with the battery life, even when I keep it on airplane mode when I'm not actively downloading a book.One of the most annoying things is its inability to retain settings. I set it to a scheduled warmth setting so that it will not keep me awake at night with the blue light. Nope! It's going to make those decisions independently every single time and when I look back, it is not scheduled for any kind of different light and it's all the way on blue.Another thing is that I always like to see the location in the book, which gives me a percentage of the book that I have read. It reverts back to no progress settings at all every single time in less than 24 hours. It's the most annoying thing in the world. I mean can they not make that persistent?", "title": "They almost had the perfect reader.", "location_and_date": "Reviewed in the United States 🇺🇸 on July 20, 2023", "verified": true, "rating": "3.0"},
{"asin": "B09RD7XM9X", "text": "It took my daughter giving me the hard sell to convince me to try this paper white. I was convinced I would miss holding a book in my hand and turning actual pages. I am a believer! The ease of this compact, easy to read kindle has me sold. I can carry it in me hand and slip it in a bag so I have my book whenever I have a few minutes. Love love that I can read outside in the sun and even with polarized sunglasses! Not a thing I don’t love about this, right down to the pretty green color I got. Just wish I took the plunge years ago!", "title": "Never looking back!", "location_and_date": "Reviewed in the United States 🇺🇸 on July 20, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "Used sparingly and the battery is faulty. It will not hold a charge overnight, and I've only read maybe 7 books on this thing over the course of 9ish months. I disappointed and would not recommend this product.", "title": "Faulty Battery", "location_and_date": "Reviewed in the United States 🇺🇸 on July 20, 2023", "verified": true, "rating": "1.0"},
{"asin": "B09RD7XM9X", "text": "I had my kindle for a week and at first I was skeptical on how much I would like to read on it, I ended up loving it and reading 2 and a half books on the short time I had it. However, today when I tried to turn it on (9 days after purchasing) it was stuck on the “waking up” page. I’m glad that Amazon support was helpful and allowed me to send it back and get a replacement, however I’m sad that it had such a short live time with me. I’m hopeful that the replacement will not have this issue once I receive it and get to use it more.", "title": "Loved it! But was unresponsive after a week of purchasing", "location_and_date": "Reviewed in the United States 🇺🇸 on July 20, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09RD7XM9X", "text": "I love it of course (even though my previous k pw lasted for almost 10yrs) this is a nice upgrade with nice features. But I especially like the overnite delivery and thr the easy trade in of the previous model. Thank you Amazon, and I do recommend. (Wish I had gotten it on Prime Day(s) though :)", "title": "kindle paperwhite( 8gb) 6.8\" screen....", "location_and_date": "Reviewed in the United States 🇺🇸 on July 20, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I was hesitant about Kindles until my sister purchased one years prior and showed me how great it is. I decided to purchase one on prime day as a treat to myself as I was celebrating an accomplishment. Best purchase! I’m so glad I’ve converted to the Kindle. I absolutely love it and been using it everyday. It came in great condition. The screen and features are amazing. The setup was very thorough and easy. I love how simple it is to transfer books from Libby/Amazon as well. It is very light to hold and bring with you anywhere. If you are a lover of books, a Kindle is a must! You won’t regret it:)", "title": "Best Treat Yo Self Purchase!", "location_and_date": "Reviewed in the United States 🇺🇸 on July 20, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "It froze during the tutorial", "title": "Freezes", "location_and_date": "Reviewed in the United States 🇺🇸 on July 20, 2023", "verified": true, "rating": "3.0"},
{"asin": "B09RD7XM9X", "text": "I love my kindle!I take it everywhere!I love having all my books in an easily accessible space. Great for night readers, day readers, any reader! And the battery life is phenomenal!Constant use: 2 weeks.", "title": "Perfect", "location_and_date": "Reviewed in the United States 🇺🇸 on July 20, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "Love loveeeee reading on my kindle. It's aesthetic and I enjoyed being able to decorate it. It can be a little slow sometimes but the battery life last me a couple days with constantly reading on it and keeping it on. 10/10 would recommend.", "title": "Sage green kindle Paperwhite", "location_and_date": "Reviewed in the United States 🇺🇸 on July 20, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09RD7XM9X", "text": "recently purchased the paperwhite 11th generation and returned it. Not into high tech, just want to read books. Had my 3rd generation fixed and don't have to learn a new device. If mine was not able to be fixed I would have gone online and purchased an old one that is so easy to use.J Tucker", "title": "Too different from the earlier ones", "location_and_date": "Reviewed in the United States 🇺🇸 on July 19, 2023", "verified": false, "rating": "1.0"},
{"asin": "B09RD7XM9X", "text": "This Kindle is a real piece of crap, it refuses to connect to my home WiFi, I had to go somewhere else to even set it up, I've tried all day to get this to Sync up with my Kindle app on my phone to no avail, I've \"returned\" six books and they still show up on my Kindle.  I can't purchase any books on my Kindle and when I purchase, I have Kindle Unlimited, on my phone app it won't upload/download to my Kindle.  I spent over 30 minutes today trying to deal with \"customer service/support\" and got absolutely nowhere.From other people I've talked to this normal.I can't find a phone number for \"customer service/support\" when I click on the \"Help\" tab on Amazon it takes me to a picture of a dog and tells me the page cannot be found!Can someone please help me with this.", "title": "A piece of crap", "location_and_date": "Reviewed in the United States 🇺🇸 on July 19, 2023", "verified": true, "rating": "1.0"},
{"asin": "B09RD7XM9X", "text": "Love this is waterproof so I can read in the tub.  (and yes I have dropped it into the water with no ill effects).Also light, easy to hold one handed and the screen is easy to read, even outdoors in sunlight.  A+++", "title": "best kindle reader ever", "location_and_date": "Reviewed in the United States 🇺🇸 on July 19, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "Broke after 1 year. Forced to buy a new one.May have been cheaper to stick with books 😟", "title": "Stopped working after 1 year", "location_and_date": "Reviewed in the United States 🇺🇸 on July 19, 2023", "verified": true, "rating": "1.0"},
{"asin": "B09RD7XM9X", "text": "I like this more than I thought I would. Works very well.", "title": "Good Product", "location_and_date": "Reviewed in the United States 🇺🇸 on July 19, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "Makes reading easy with adjustable light.  Easy to work.", "title": "Love this Kindle.", "location_and_date": "Reviewed in the United States 🇺🇸 on July 19, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I've had this Kindle Paperwhite for almost a year now. The best thing about it is the screen which allows you to read outdoors in the sun - it works well, and I appreciate the ability to do that. The battery is very long-lasting also. However, I'm disappointed in almost everything else. Although you can adjust the font size for the books you read, there is no option to adjust the settings/size of the text in any of the menus or the library.  So if your eyes aren't quite as good as they once were, this reader isn't very helpful in finding a book on your list. Another disappointment is the lack of access to Kindle \"events\" - i.e., the Kindle Challenge cannot be viewed or accessed on this device. You can't access Reader Insights - so you can't keep track of the books read, days/weeks read, etc. You can do all those things on a Fire tablet or even the web browser - I just can't understand why they wouldn't provide Kindle information on a Kindle. As I said, I appreciate the screen & battery - but I feel the Paperwhite is overpriced and there are important features that are missing.", "title": "Very disappointed", "location_and_date": "Reviewed in the United States 🇺🇸 on July 19, 2023", "verified": true, "rating": "3.0"},
{"asin": "B09RD7XM9X", "text": "Traded in my old kindle and finally decided to get a paperwhite! Absolutely amazing quality ! So happy!", "title": "Absolutely obsessed!", "location_and_date": "Reviewed in the United States 🇺🇸 on July 19, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "Battery lasts long between reading days- probably at least a week", "title": "Awesome", "location_and_date": "Reviewed in the United States 🇺🇸 on July 19, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I got the denim 16g one and it’s perfect. I can’t notice the difference between that and my basic 2019 kindle. The screen is bigger but holding it is Fine. It has a night mode where the screen turns orange, and it has a dark and light mode. The only complaint I have is how smudgy the screen gets with fingerprints. Decorated case for inspo", "title": "Love it !", "location_and_date": "Reviewed in the United States 🇺🇸 on July 19, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I like how easy it is to hold and how you can set the lights", "title": "Kindle", "location_and_date": "Reviewed in the United States 🇺🇸 on July 19, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "year and a half old screen frozen and wont reboot.  has not been dropped or wet. very disappointed customer service offered a 15% discount on a new one.  Not a happy customer!!", "title": "Frozen screen only a year and a half old screen frozen and wont reboot.  Not a happy customer!!", "location_and_date": "Reviewed in the United States 🇺🇸 on July 19, 2023", "verified": true, "rating": "1.0"},
{"asin": "B09RD7XM9X", "text": "I didn’t think I would like having a kindle over a book this much! It’s so comfortable to read on. From sitting at the table, couch, in bed laying how ever I want. Not having to hold the book in awkward ways to be more comfortable. It’s literally perfect!I just like the physical book bc I love to see my progress on a book shelf.", "title": "Im Obsessed!", "location_and_date": "Reviewed in the United States 🇺🇸 on July 19, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "what happened to amazon kindle quality. First one that purchased lasted very long time and was very responsive with buttons. It detects touch but response is slow....not sure what kind of processor is used.Amzon improve Kindle quality!!!", "title": "slow", "location_and_date": "Reviewed in the United States 🇺🇸 on July 19, 2023", "verified": true, "rating": "3.0"},
{"asin": "B09RD7XM9X", "text": "I was a die hard old school, I want my book.  My wife said Prime days are coming, here barrow my paperwhite and see if you like it.  It took almost 3 pages to fall in love.  Now I got my own and don't plan on turning back.", "title": "Book, what book?", "location_and_date": "Reviewed in the United States 🇺🇸 on July 18, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I love it, that’s all", "title": "BEST THING EVER", "location_and_date": "Reviewed in the United States 🇺🇸 on July 18, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I received this as a gift the year it came out. I absolutely adore it, especially because it lets me read in the bath and in the shower! I'm really busy so any chance I get to read is precious. Reading at night with the screen dimmed so I don't disturb my partner is also convenient. The kindle is so lightweight. I still love paper books deeply... but I cannot read them in the shower or with the lights off! The only thing I would change is to make the margins a little wider for easier one handed reading while lying down and/or making the page turning controls customizable so you can adjust them based on your reading position.", "title": "Lets me read in the shower!!", "location_and_date": "Reviewed in the United States 🇺🇸 on July 18, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "After being a strictly audiobook reader for a few years now, the Kindle Paperwhite has me wanting to read print books again! I like the screen so much better than reading other devices, it doesn't glare or feel like I'm reading on a screen. Love that I can store more books than I can read on the device.", "title": "Makes me want to read print again!", "location_and_date": "Reviewed in the United States 🇺🇸 on July 18, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I love it", "title": "Spectacular", "location_and_date": "Reviewed in the United States 🇺🇸 on July 18, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I have had this for about 1 week.The battery life has been good so far. I like the USB c connector. It allowed me to get rid of my USB A to mini cable. When I got my Kindle it updated twice to bring it up to date. It easy to hold. This my first  Kindle without the page turn buttons. I have had no issues with turning the pages by tapping the lower right/left  corner. I strongly suggest a case. It helps me  hold the reader and protects the power button from inadvertently pressing it. I went with allowing the ads and like others have indicated it is no real problem since they only appear on the startup page.  I feel since it saves $20 it is ok. I have always spent the $20 to avoid the advertising. It is a worthy upgrade over my old Oasis.", "title": "Great replacement for my Oasis.", "location_and_date": "Reviewed in the United States 🇺🇸 on July 18, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I am very happy with the new Kindle. It has a wider screen which means I do not have to constantly turn the page. The newer features make for easy navigation in the settings.", "title": "New Kindle Paperwhite", "location_and_date": "Reviewed in the United States 🇺🇸 on July 18, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I’ve been using kindle unlimited for awhile now and this is a great addition to it. Much better than a phone for reading out in the sun and nice that it’s water resistant! I’ll hopefully be using this for many years to come.", "title": "Great device for reading!", "location_and_date": "Reviewed in the United States 🇺🇸 on July 18, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "We've bought kindles for our older children in the past once they started reading. So when our our two younger started reading we (and they!) were excited to buy them their own kindles.However, the joy was short lived. We tried to lock them down and reduce their access to the open internet, like we had done in the past. A day later my daughter says \"dad, what are these books I keep seeing?\" Sure enough, there are advertisements on the lock screen for random unfiltered books. That's annoying. So we disabled it. A few minutes later, \"dad, what are all these books?\". Sheesh. What now? Oh, \"Recommended books\".In the past you could disable the \"Recommended Books\" section on the home screen. But with a recent update there doesn't seem to be any way to disable the \"Recommended Books\" advertisements that appear on the home screen.I have been able to disable access to accessing these books when clicked. But the books are still showing up in a list! And we have no interest in buying them. And certainly no interest in our 7 year old reading the suggestive adult content titles and covers.Amazon, why-oh-why would you remove the ability for content moderation on a platform that once supported it?We'll be returning these I guess. What a shame.", "title": "Kindles remove ability to moderate content. No longer safe for kids of all ages.", "location_and_date": "Reviewed in the United States 🇺🇸 on July 18, 2023", "verified": true, "rating": "1.0"},
{"asin": "B09RD7XM9X", "text": "I bought the kindle during prime day and the kindle won’t turn on and I can’t get a replacement because it’s not linked to any account. Now I have to return and pay full price for another. Absolute scam", "title": "Broke down after a few days", "location_and_date": "Reviewed in the United States 🇺🇸 on July 18, 2023", "verified": false, "rating": "1.0"},
{"asin": "B09RD7XM9X", "text": "I'm not a huge reader, but honestly with kindle, I found myself reading more and actually enjoyed reading. It's light and easy on the eyes. Highly recommend it.", "title": "Loving the ads as well", "location_and_date": "Reviewed in the United States on July 18, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "Such trash that the Lock Screen has to be hideously littered with ads. Apparently I “agreed” to that with this purchase and in order to get rid of them I owe a fee? That’s a really tacky move on amazons part. Do better!!!", "title": "Lock Screen ads", "location_and_date": "Reviewed in the United States on July 18, 2023", "verified": true, "rating": "1.0"},
{"asin": "B09RD7XM9X", "text": "I read on my phone my iPad and physical books. The size and comfort of this kindle is awesome. It will definitely take the place of my iPad. So excited !!", "title": "It’s perfect for a daily reader.", "location_and_date": "Reviewed in the United States on July 18, 2023", "verified": false, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "My bf and I are sticklers about a dark room when we sleep. The dark mode is perfect for not bothering him.", "title": "Best for late night reading", "location_and_date": "Reviewed in the United States on July 18, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I did not get the ad-free display but I keep the tablet face down when not using.I read often throughout the week and took it on a camping weekend with heavy reading and the device never fell below 70% battery. Charges very fast.Feels very lightweight but doesn't feel flimsy.Very portable size.I primarily use Dark Mode and no issues reading anywhere I have been.Has a built in web browser but it is very barebones and not worth using unless desperate (your phone will always be better).", "title": "Good Enough", "location_and_date": "Reviewed in the United States on July 17, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n     At first I was iffy about buying it because I prefer physical books but I ended up loving it! It’s so convenient and easy to carry around. It literally fits anywhere! Super light and easy to read on.", "title": "Love it", "location_and_date": "Reviewed in the United States on July 17, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "This is the best purchase I ever could have made!!!!! I read at least 8 books a month and live how easy I can read and the anti glare is my favorite!!!", "title": "Love it!!", "location_and_date": "Reviewed in the United States on July 17, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "Great battery life, clear in the sun. Wife loves it!!!!", "title": "Better than a book", "location_and_date": "Reviewed in the United States on July 17, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "So far I am loving my kindle and I was so reluctant to purchase 😢. It is so convenient and has a long battery life. Mad at my self for waiting so long to buy this!", "title": "Great great great", "location_and_date": "Reviewed in the United States on July 17, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09RD7XM9X", "text": "UPDATE - customer service has been wonderful - they will be replacing the kindle!!This is what my kindle looks like - can’t get ahold of anyone to fix or replace.  Not even 4-months and doesn’t work", "title": "Kindle quit working - customer service great!!", "location_and_date": "Reviewed in the United States on July 17, 2023", "verified": true, "rating": "3.0"},
{"asin": "B09RD7XM9X", "text": "Easy to use and good value", "title": "Easy to use and good value", "location_and_date": "Reviewed in the United States on July 17, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I had the last version of the Kindle Paperwhite and I loved it. I finally decided it was time for an upgrade when usb-c was becoming the only charger we kept around. So I traded in my old one and bought a new one a few days later. It runs a lot better than my old one since it's newer and it's bigger (enough that I noticed when I got it). I like the new size and it's held up well so far. The battery lasts for weeks and it looks amazing in the sun.", "title": "I love it!", "location_and_date": "Reviewed in the United States on July 17, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I have been using Kindles for more than 10 years and jumped at the opportunity to replace my 6th generation PaperWhite with this one during Prime day. Note: I only bought this one when the price dropped. Otherwise I would have continued with the old one. Recommend.", "title": "The best eReader for the price", "location_and_date": "Reviewed in the United States on July 17, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "Came the same day I ordered it. I turned on and it found my Wi-Fi and said hello Albert let’s get started and I was shocked. I still haven’t been able to figure out how to make the screen brighter but I’ll get it just give me time. I have Kindle unlimited I wish there was a way I could fine out many books  I’ve read it must be over 500 but because you to return them can’t count them oh still love to read.", "title": "That was fast", "location_and_date": "Reviewed in the United States on July 17, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I’ve never had an e-reader before and boy, am I glad I purchased this! Easy to use and handle. Screen easy to see in any light conditions. Recommend!", "title": "Love it!", "location_and_date": "Reviewed in the United States on July 17, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "Battery life is low.  All of a sudden I have lost the ability to read my book.  I have to think my kindle will not work for me.  I am very disappointed.", "title": "Disappointment", "location_and_date": "Reviewed in the United States on July 17, 2023", "verified": true, "rating": "3.0"},
{"asin": "B09RD7XM9X", "text": "This was the best gift I’ve ever gotten. I got it the Wednesday before Mother’s Day. And I’ve charged it THREE times. I read every day. Multiple hours a day. This is the best way to read. Looks crisp. Exactly like a book and I feel like I read faster", "title": "THE BEST", "location_and_date": "Reviewed in the United States on July 17, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I had the original Kindle and the Kindle Fire and this one blows them out of the water. I love that there is no glare and the sunlight does not affect my reading. I also am a big nighttime reader or reading in the car at night so the adjustable back light is perfect for that. A feature I also love is the warmth feature so I can turn it down in the evening so the blue light does not affect my circadian rhythm as much.", "title": "The best Kindle I’ve owned", "location_and_date": "Reviewed in the United States on July 17, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I’ve had my new kindle about a week and already there are scratches in the screen!  For the price it should come with a screen protector if it’s going to scratch that easily", "title": "Scratches too easily", "location_and_date": "Reviewed in the United States on July 17, 2023", "verified": true, "rating": "1.0"},
{"asin": "B09RD7XM9X", "text": "Easy to use.  Love the large screen", "title": "Kindle white", "location_and_date": "Reviewed in the United States on July 17, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n     I love how compact and portable it is!", "title": "Love it!", "location_and_date": "Reviewed in the United States 🇺🇸 on July 17, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "It's a great product for reading, but mine broke after 7 months - the screen is streaky and font faded - a common problem for many", "title": "Good at first but then broke", "location_and_date": "Reviewed in the United States 🇺🇸 on July 17, 2023", "verified": true, "rating": "2.0"},
{"asin": "B09RD7XM9X", "text": "Setup was easy, since I already had the Kindle app, it's light weight and easy to use. I have already utilized my new Kindle Unlimited subscription and I am happy to say it's well worth it too.", "title": "So excited", "location_and_date": "Reviewed in the United States 🇺🇸 on July 16, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I ordered the Kindle Paperwhite.  I was excited to receive it, but couldn't load the Libby app onto it that I used on my Fire tablet to borrow books. I contacted CS & was told in a fairly snotty way \"tablets & Kindles are very different \". Ok, I know that. He told me I cannot borrow books from my local library to read on the Kindle, so I boxed it up, resigned to returning it and maybe buying a different tablet with better battery life than my Fire tablet has (very sucky, btw). I happened to mention it to a family member and she said the rep was WRONG. Then she proceeded to tell me in under 5 minutes how to borrow books from Libby for this Kindle.  Easy. (In case someone else needs to know: you can borrow the books via your phone; after you borrow, you will be prompted to \"Get the library book\" and will be asked to select WHICH  device you want it sent to. Stupid easy). I'm really disappointed in the epically bad tech support I got from Amazon today. The device is ok. I'm not loving it yet, but I hope I do eventually. Amazon usually has great customer service,  but today they let me down. (I was not sent an opportunity to review my tech support call, so left it here - perhaps Amazon will care & see that support staff are better trained and can help others with a similar problem).", "title": "Customer service rep gave bad info", "location_and_date": "Reviewed in the United States 🇺🇸 on July 16, 2023", "verified": true, "rating": "3.0"},
{"asin": "B09RD7XM9X", "text": "I had never read a book cover to cover until my kindle and now in 6 months I haven’t read 18! It makes reading so convenient. It’s a perfect size and great for the pool, beach, porch, laying in bed, ANYWHERE! But it now!!!", "title": "JUST BUY IT", "location_and_date": "Reviewed in the United States 🇺🇸 on July 16, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "Upgraded from my older 6” kindle to the 6.8” and it has changed my life! I love it! Super fast. Stays charged much better!", "title": "Upgrade!", "location_and_date": "Reviewed in the United States 🇺🇸 on July 16, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "My old Kindle was in color. Was amazed this newer version was grey scale. Disappointed at first, but I love the very light weight. When I fall asleep resting and the “book” falls into my face, it doesn’t feel like a concussion injury. Don’t know about the waterproof quality, but I’ve quickly learned to love this little guy.  (Miss the color for locating titles of my books - the front cover in color helped me recognize a title", "title": "Black & white!", "location_and_date": "Reviewed in the United States 🇺🇸 on July 16, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09RD7XM9X", "text": "Love my new Paperwhite!", "title": "another winner!", "location_and_date": "Reviewed in the United States 🇺🇸 on July 16, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09RD7XM9X", "text": "This is the best kindle yet!!! I can read in bed without the lights even on. Perfect for when I wake up I. The middle of the night unable to go ba k to sleep. I’m able to read in bed without disturbing my husbands sleep.", "title": "Don’t leave home without it", "location_and_date": "Reviewed in the United States 🇺🇸 on July 16, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I have read more now since buying a Kindle in April than I have in almost a decade! I used to read all the time growing up but as I got older I just couldn’t find the motivation for it, thanks to my Kindle that love has been renewed and now I can’t wait to find my next book to read.", "title": "This is your sign to buy a Kindle!", "location_and_date": "Reviewed in the United States 🇺🇸 on July 16, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I like everything about my kindle.  Easy to use and rewarding to read just like a physical book in your hand…", "title": "Just perfect!", "location_and_date": "Reviewed in the United States on July 16, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "This is a must for any avid reader, or to ket the kids read while traveling and not having to lug around those heavy books!", "title": "Love kindle!", "location_and_date": "Reviewed in the United States on July 16, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I long for my old Kindle but with a backlight.  I bought this because I thought it would be better and it is as far as the light goes.  But there is nothing else I like about it.  The darn screen jumps at the slightest touch to things you don’t even know what they are and you were not looking for.  I don’t like it but maybe I will get used to it.  During the day, I read my old one.  If I read in bed at night, I attempt to use this one but it is frustrating because of how sensitive the screen is.  You look at it cross-eyed, and it goes to some weird screen.  Why?", "title": "Too Touchy!", "location_and_date": "Reviewed in the United States on July 16, 2023", "verified": true, "rating": "3.0"},
{"asin": "B09RD7XM9X", "text": "Really very nice and easy to use.", "title": "Very good.", "location_and_date": "Reviewed in the United States on July 16, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I bought this for my mother in law.  She is enjoying reading books again", "title": "Mother in law", "location_and_date": "Reviewed in the United States on July 15, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "Unit just dies randomly but just have to start it again. WiFi connection loads unit up with junk ads and spam. I NEVER connect to WiFi as a result.  Use it all the time in spite of those negatives.", "title": "Erratic", "location_and_date": "Reviewed in the United States on July 15, 2023", "verified": true, "rating": "3.0"},
{"asin": "B09RD7XM9X", "text": "I bought for myself and I liked a lot. I got one for my wife long time ago and now got one for my use. The quality of the Kindles are amazing. I really recommend this product", "title": "Very good quality", "location_and_date": "Reviewed in the United States on July 15, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "This is my 3-4 Kindle and have passed older ones to family and they love them. This one is so easy touse and larger than my old one.", "title": "Love Kindles", "location_and_date": "Reviewed in the United States on July 15, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "Finally broke down and got the paper white on prime day.  Have always been a fan of real books vs digital but I have to say am loving my new kindle.  I like that it is so convenient to tote around and especially love that I can read it without my reading glasses! :)Also appreciate that it is water resistant so not worried about reading in the bath, by the pool, etc.Have not explored all its features yet, but so far thumbs up! I may be a digital book convert!", "title": "Love new kindle", "location_and_date": "Reviewed in the United States on July 15, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09RD7XM9X", "text": "I bought this for my mom during the prime day sale because I have one that I purchased in February and she said she would love to have one. She was shocked when this came in the mail and she loves it!", "title": "Love it!!", "location_and_date": "Reviewed in the United States on July 15, 2023", "verified": true, "rating": "5.0"}
]